{
  "policy": {
    "name": "Windows 2012 R2", 
    "url": "https://api.cloudpassage.com/v1/policies/4ac311c6058311e5971505fdb7cd3af1", 
    "used_by": [
      {
        "id": "9119a3c0dbe2013270b93c764e10c220", 
        "name": "Windows"
      }
    ], 
    "platform": "windows", 
    "rules": [
      {
        "comment": "This policy setting controls whether application write failures are redirected to defined registry and file system locations. This policy setting mitigates applications that run as administrator and write run-time application data to %ProgramFiles%, %Windir%, %Windir%\\system32, or HKLM\\Software.\r\nThe options are:\r\n- Enabled: (Default) Application write failures are redirected at run time to defined user locations for both the file system and registry.\r\n- Disabled: Applications that write data to protected locations fail. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "EnableVirtualization", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\User Account Control: Virtualize file and registry write failures to per-user\r\nlocations", 
            "active": true
          }
        ], 
        "name": "2.3.18.9 'User Account Control: Virtualize file and registry write failures to per-user locations'"
      }, 
      {
        "comment": "This policy setting determines the number of renewed, unique passwords that have to be associated with a user account before you can reuse an old password. The value for this policy setting must be between 0 and 24 passwords. The default value for Windows Vista is 0 passwords, but the default setting in a domain is 24 passwords. To maintain the effectiveness of this policy setting, use the Minimum password age setting to prevent users from repeatedly changing their password.The recommended state for this setting is: 24 or more password(s). ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": ">23", 
            "object_type": "local_security_policy_settings", 
            "setting": "PasswordHistorySize", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to 24 or more password(s)\r\nComputer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Password Policy\\Enforce password history", 
            "active": true
          }
        ], 
        "name": "1.1.1 Set 'enforce password history' to '24 or more password(s)'"
      }, 
      {
        "comment": "This policy setting defines how long a user can use their password before it expires. Values for this policy setting range from 0 to 999 days. If you set the value to 0, the password will never expire. The default value for this policy setting is 42 days. Because attackeres can crack passwords, the more frequently you change the password the less opportunity an attacker has to use a cracked password. However, the lower this value is set, the higher the potential for an increase in calls to help desk support due to users having to change their passwords or forgetting which password is current. the recommended state for this setting is 60 or fewer days, but not 0 ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "> 0", 
            "object_type": "local_security_policy_settings", 
            "setting": "MaximumPasswordAge", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to 60 or fewer days, but not 0. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Password Policy\\Enforce password history", 
            "active": true
          }, 
          {
            "exportable": true, 
            "desired_value": "< 60", 
            "object_type": "local_security_policy_settings", 
            "setting": "MaximumPasswordAge", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to 60 or fewer days, but not 0. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Password Policy\\Enforce password history", 
            "active": true
          }
        ], 
        "name": "1.1.2 Set 'Maximum password age' to 60 or fewer days, but not 0 "
      }, 
      {
        "comment": "This policy setting determines the number of days that you must use a password before you can change it. The range of values for this policy setting is between 1 and 999 days. (You may also set the value to 0 to allow immediate password changes.) The default value for this setting is 0 days. The recommended state for this setting is: 1 or more day(s)\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "> 0", 
            "object_type": "local_security_policy_settings", 
            "setting": "MinimumPasswordAge", 
            "suggestion": "to implement the recommended configuration state, set the fllowing Group Policy setting to 1 or more day(s) \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Password Policy\\Minimum password age", 
            "active": true
          }
        ], 
        "name": "1.1.3 Set 'Minimum password age' to '1 or more day(s)' "
      }, 
      {
        "comment": "This policy setting determines the least number of characters that make up a password for a user account. There are many different heories about how to determine the best password length for an organization, but perhaps \"pass phrase\" is a better term than \"passward\". In Microsoft Windows 2000 or later, pass phrases can be quite long and can include spaces. Therefore, a phrase such as \"I want to drink a $5 milkshake\" is a valid pass phrase; it is a considerably stronger password than an 8 or 10 character string of random numbers and letters, and yet is easier to remember. Users must be educated about the proper selection and maintenance of passwords, especially with regard to password length.\r\nIn enterprise environments, the ideal value for the Minimum password length setting is 14 characters, however you should adjust this value to meet your organization's business requirements. The recommended state for this setting is: 14 or more character(s).", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "> 13", 
            "object_type": "local_security_policy_settings", 
            "setting": "MinimumPasswordLength", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to 14 or more character(s).\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Password Policy\\Minimum password length", 
            "active": true
          }
        ], 
        "name": "1.1.4 Set 'Minimum password length' to '14 or more character(s)' "
      }, 
      {
        "comment": "This policy setting checks all new passwords to ensure that they meet basic requirements for strong passwords. When this policy is enabled, passwords must meet the following minimum requirements:\r\n- Not contain the user's account name or parts of the user's full name that exceed two consecutive characters\r\n- Be at least six characters in length\r\n- Contain characters from three of the following four categories: - English uppercase characters (A through Z)\r\n- English lowercase characters (a through z)\r\n- Base 10 digits (0 through 9)\r\n- Non-alphabetic characters (for example, !, $, #, %)\r\n- A catch-all category of any Unicode character that does not fall under the previous four categories. This fifth category can be regionally specific.\r\nEach additional character in a password increases its complexity exponentially. For instance, a seven-character, all lower-case alphabetic password would have 267 (approximately 8 x 109 or 8 billion) possible combinations. At 1,000,000 attempts per second (a capability of many password-cracking utilities), it would only take 133 minutes to crack. A seven-character alphabetic password with case sensitivity has 527 combinations. A seven-character case- sensitive alphanumeric password without punctuation has 627 combinations. An eight- character password has 268 (or 2 x 1011) possible combinations. Although this might seem to be a large number, at 1,000,000 attempts per second it would take only 59 hours to try all possible passwords. Remember, these times will significantly increase for passwords that use ALT characters and other special keyboard characters such as \"!\" or \"@\". Proper use of the password settings can help make it difficult to mount a brute force attack. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "1", 
            "object_type": "local_security_policy_settings", 
            "setting": "PasswordComplexity", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Password Policy\\Password must meet complexity requirements", 
            "active": true
          }
        ], 
        "name": "1.1.5 Set 'Password must meet complexity requirements' to 'Enabled'"
      }, 
      {
        "comment": "This policy setting determines whether the operating system stores passwords in a way that uses reversible encryption, which provides for application protocols that require knowledge of the user's password for authentication purposes. Passwords that are stored with reversible encryption are essentially the same as plaintext versions of the passwords. The recommended state fir this setting is: Disabled ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "0", 
            "object_type": "local_security_policy_settings", 
            "setting": "ClearTextPassword", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Password Policy\\Store passwords using reversible encryption\r\n\r\n", 
            "active": true
          }
        ], 
        "name": "1.1.6 Set 'Store passwords using reversible encryption' to 'Disabled'"
      }, 
      {
        "comment": "This policy setting determines the length of time that must pass before a locked account is unlocked and a user can try to log on again. The setting does this by specifying the number of minutes a locked out account will remain unavailable. If the value for this policy setting is configured to 0, locked out accounts will remain locked out until an administrator manually unlocks them. \r\nAlthough it might seem like a good idea to configure the value for this policy setting to a high value, such a configuration will likely increase the number of calls that the help desk receives to unlock accounts locked by mistake. Users should be aware of the length of time a lock remains in place, so that they realize they only need to call the help desk if they have an extremely urgent need to regain access to their computer. The recommeded state for this setting is: 15 or more minute(s). ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": ">14", 
            "object_type": "local_security_policy_settings", 
            "setting": "LockoutDuration", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to 15 or more minute(s).\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Account Lockout Policy\\Account lockout duration", 
            "active": true
          }
        ], 
        "name": "1.2.1 Set 'Account lockout duration' to '15 or more minute(s)'"
      }, 
      {
        "comment": "This policy setting determines the number of failed logon attempts before the account is locked. The recommended state for this setting is 10 or fewer. Setting this policy to 0 does not conform with the benchmark as doing so disables the account lockout threhold\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "> 0", 
            "object_type": "local_security_policy_settings", 
            "setting": "LockoutBadCount", 
            "suggestion": "To establish the recommeded configuration via GP, set the following UI path to 10 or fewer invalid logon attempt(s) includisve. Setting this policy to 0 does not conform with the benchmark as doing so disables the account lockout threshold\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Account Lockout Policy\\Account lockout threshold", 
            "active": true
          }, 
          {
            "exportable": true, 
            "desired_value": "< 11", 
            "object_type": "local_security_policy_settings", 
            "setting": "LockoutBadCount", 
            "suggestion": "To establish the recommeded configuration via GP, set the following UI path to 10 or fewer invalid logon attempt(s) includisve. Setting this policy to 0 does not conform with the benchmark as doing so disables the account lockout threshold\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Account Lockout Policy\\Account lockout threshold", 
            "active": true
          }
        ], 
        "name": "1.2.2 Set 'Account lockout threshold' to 10 or fewer invalid logon attempts(s) but not 0 "
      }, 
      {
        "comment": "This policy setting determines the length of time before the Account lockout threshold resets to zero. The default value for this policy setting is Not Defined. If the Account lockout threshold is defined, this reset time must be less than or equal to the value for the Account lockout duration setting.\r\nIf you leave this policy setting at its default value or configure the value to an interval that is too long, your environment could be vulnerable to a DoS attack. An attacker could maliciously perform a number of failed logon attempts on all users in the organization, which will lock out their accounts. If no policy were determined to reset the account lockout, it would be a manual task for administrators. Conversely, if a reasonable time value is configured for this policy setting, users would be locked out for a set period until all of the accounts are unlocked automatically. The recommended state for this setting is: 15 or more minute(s).", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "> 14", 
            "object_type": "local_security_policy_settings", 
            "setting": "ResetLockoutCount", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to 15 or more minute(s)\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Account Lockout Policy\\Reset account lockout counter after", 
            "active": true
          }
        ], 
        "name": "1.2.3 Set 'Reset account lockout counter after' to '15 or more minute"
      }, 
      {
        "comment": "This policy setting allows a user to adjust the maximum amount of memory that is available to a process. The ability to adjust memory quotas is useful for system tuning, but it can be abused. In the wrong hands, it could be used to launch a denial of service (DoS) attack.\r\nThe recommended state for this setting is: Administrators, LOCAL SERVICE, NETWORK SERVICE.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators, LOCAL SERVICE, NETWORK SERVICE", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeIncreaseQuotaPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators, LOCAL SERVICE, NETWORK SERVICE\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Adjust memory quotas for a process", 
            "active": true
          }
        ], 
        "name": "2.2.5 Set 'Adjust memory quotas for a process' to 'Administrators, LOCAL SERVICE, NETWORK SERVICE' "
      }, 
      {
        "comment": "This policy setting determines which users or groups have the right to log on as a Terminal Services client. Remote desktop users require this user right. If your organization uses Remote Assistance as part of its help desk strategy, create a group and assign it this user right through Group Policy. If the help desk in your organization does not use Remote Assistance, assign this user right only to the Administrators group or use the restricted groups feature to ensure that no user accounts are part of the Remote Desktop Users group.\r\nRestrict this user right to the Administrators group, and possibly the Remote Desktop Users group, to prevent unwanted users from gaining access to computers on your network by means of the Remote Assistance feature. The recommended state for this setting is:\r\n \r\nDomain controllers: Administrators.\r\nMember servers: Administrators, Remote Desktop Users", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeRemoteInteractiveLogonRight", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting as described in the description.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Allow log on through Remote Desktop Services", 
            "active": true
          }
        ], 
        "name": "2.2.7 Configure 'Allow log on through Remote Desktop Services'"
      }, 
      {
        "comment": "This sercurity setting is used by Credential Manager during Backup and Restore. No accounts should have this user right, as it is only assigned to Winlogon. User's saved credentials might be compromised if this user right is assigned to other entities. The recommended state for this setting is: No one ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeTrustedCredManAccessPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to No One\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Access Credential Manager as a trusted caller", 
            "active": true
          }
        ], 
        "name": "2.2.1 Set 'Access Credential Manager s a trusted caller' to 'No One' "
      }, 
      {
        "comment": "This policy setting allows other users on the network to connect to the computer and is required by various network protocols that include Server Message Block (SMB)based protocols, NetBIOS, Common Internet File System (CIFS), and Component Object Model Plus (COM+).\r\nLevel 1 - Domain Controller. The recommended state for this setting is: Administrators, Authenticated Users, ENTERPRISE DOMAIN CONTROLLERS.\r\n \r\nLevel 1 - Member Server. The recommended state for this setting is: Administrators, Authenticated Users.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators, Autheticated Users ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeNetworkLogonRight", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting:\r\n\r\nTo implement the recommended configuration state, set the following Group Policy setting:", 
            "active": true
          }
        ], 
        "name": "2.2.2 Set 'Access this computer from the network' "
      }, 
      {
        "comment": "This policy setting allows a process to assume the identity of any user and thus gain access to the resources that the user is authorized to access.\r\nThe recommended state for this setting is: No One.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeTcbPrivilege", 
            "suggestion": "Computer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Act as part of the operating system", 
            "active": true
          }
        ], 
        "name": " 2.2.3 Set 'Act as part of the operating system' to 'No One' "
      }, 
      {
        "comment": "This policy setting specifies which users can add computer workstations to a specific domain. For this policy setting to take effect, it must be assigned to the user as part of the Default Domain Controller Policy for the domain. A user who has been assigned this right can add up to 10 workstations to the domain. Users who have been assigned the Create Computer Objects permission for an OU or the Computers container in Active Directory can add an unlimited number of computers to the domain, regardless of whether they have been assigned the Add workstations to a domain user right.\r\nBy default, all users in the Authenticated Users group have the ability to add up to 10 computer accounts to an Active Directory domain. These new computer accounts are created in the Computers container.\r\nIn Windowsbased networks, the term security principal is defined as a user, group, or computer that is automatically assigned a security identifier to control access to resources. In an Active Directory domain, each computer account is a full security principal with the ability to authenticate and access domain resources. However, some organizations may want to limit the number of computers in an Active Directory environment so that they can consistently track, build, and manage the computers. If users are allowed to add computers to the domain, tracking and management efforts would be hampered. Also, users could perform activities that are more difficult to trace because of their ability to create additional unauthorized domain computers.\r\nThe recommended state for this setting is: Administrators.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeMachineAccountPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Add workstations to domain", 
            "active": true
          }
        ], 
        "name": "2.2.4 Set 'Add worstations to domain' to 'Administrators' "
      }, 
      {
        "comment": "This policy setting determines which users can interactively log on to computers in your environment. Logons that are initiated by pressing the CTRL+ALT+DEL key sequence on the client computer keyboard require this user right. Users who attempt to log on through Terminal Services or IIS also require this user right.\r\nThe Guest account is assigned this user right by default. Although this account is disabled by default, it is recommended that you enable this setting through Group Policy. However, this user right should generally be restricted to the Administrators and Users groups. Assign this user right to the Backup Operators group if your organization requires that they have this capability.\r\nThe recommended state for this setting is: Administrators.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeInteractiveLogonRight", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Allow log on locally", 
            "active": true
          }
        ], 
        "name": "2.2.6 Set 'Allow log on locally' to 'Administrators'"
      }, 
      {
        "comment": "Select On (recommended) to have Windows Firewall with Advanced Security use the settings for this profile to filter network traffic. If you select Off, Windows Firewall with Advanced Security will not use any of the firewall rules or connection security rules for this profile. The recommended state for this settins is: On", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\DomainProfile", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "EnableFirewall", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to On (recommended)\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Domain Profile\\Windows Firewall: Domain: Firewall state", 
            "active": true
          }
        ], 
        "name": "9.1.1 Set 'Windows Firewall: Domain: Firewall state' to 'On' "
      }, 
      {
        "comment": "This user right is useful to kernel-mode components that extend the object namespace. However, components that run in kernel mode have this user right inherently. Therefore, it is typically not necessary to specifically assign this user right. The recommended state for this setting is: No One", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeCreatePermanentPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to No One.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Create permanent shared objects", 
            "active": true
          }
        ], 
        "name": " 2.2.14 Set 'Create permanent shared objects' to 'No One'"
      }, 
      {
        "comment": "This policy setting allows users to circumvent file and directory permissions to back up the system.The user right is enabled only when an application (such as NTBACKUP) attempts to access a file or directory through the NTFS file system backup application programming interface (API). Otherwise, the assigned file and directory  permissions apply. The recommeded state for this setting is: Administrator", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeBackupPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Back up files and directories", 
            "active": true
          }
        ], 
        "name": "2.2.8 Set 'Back up files and directories' to 'Administrators'"
      }, 
      {
        "comment": "This policy setting determines whether local accounts that are not password protected can be used to log on from locations other than the physical computer console. If you enable this policy setting, local accounts that have blank passwords will not be able to log on to the network from remote client computers. Such accounts will only be able to log on at the keyboard of the computer. The  recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "LimitBlankPasswordUse", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Accounts: Limit local account use of blank passwords to console logon only", 
            "active": true
          }
        ], 
        "name": "2.3.1.3 Set 'Accounts: limit local account use of blank passwords to console logon only'"
      }, 
      {
        "comment": "The built-in local administrator account is a well-know account name that attackers will target. It is recommended to choose another name for this account, and to avoid names that denote administrative or elevated access accounts. Be sure to also change the default description for the local administrator (through the computer management console)", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "NOT: Administrator", 
            "object_type": "local_security_policy_settings", 
            "setting": "NewAdministratorName", 
            "suggestion": "Configure the following Group Policy setting in a manner that does not denote that the account has administrative or elevated access:\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Accounts: Rename administrator account", 
            "active": true
          }
        ], 
        "name": "2.3.1.4 Configure 'Accounts: Rename administrator account' "
      }, 
      {
        "comment": "\r\nThis policy setting determines which users and groups can change the time and date on the internal clock of the computers in your environment. Users who are assigned this user right\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights\r\nAssignment\\Back up files and directoriescan affect the appearance of event logs. When a computer's time setting is changed, logged events reflect the new time, not the actual time that the events occurred.\r\nWhen configuring a user right in the SCM enter a comma delimited list of accounts. Accounts can be either local or located in Active Directory, they can be groups, users, or computers. Note: Discrepancies between the time on the local computer and on the domain controllers in your environment may cause problems for the Kerberos authentication protocol, which could make it impossible for users to log on to the domain or obtain authorization to access domain resources after they are logged on. Also, problems will occur when Group Policy is applied to client computers if the system time is not synchronized with the domain controllers. The recommended state for this setting is: Administrators, LOCAL SERVICE.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators, LOCAL SERVICE", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeSystemtimePrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators, LOCAL SERVICE.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Change the system time", 
            "active": true
          }
        ], 
        "name": " 2.2.9 Set 'Change the system time' to 'Administrators, LOCAL SERVICE'"
      }, 
      {
        "comment": "The built-in local guest account in another well-known name to attackers. It it recommended to rename this account to something that does not indicate its purpose. Even if you disable this account, which is recommended, ensure that you rename it for added security", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "NOT: Guest", 
            "object_type": "local_security_policy_settings", 
            "setting": "NewGuestName", 
            "suggestion": "Set the following UI path:\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Accounts: Rename guest account", 
            "active": true
          }
        ], 
        "name": "2.3.1.5 Configure 'Accounts: Rename guest account' "
      }, 
      {
        "comment": "This policy setting allows administrators to enable the more precise auditing capabilities present in Windows Vista.\r\nThe Audit Policy settings available in Windows Server 2003 Active Directory do not yet contain settings for managing the new auditing subcategories. To properly apply the auditing policies prescribed in this baseline, the Audit: Force audit policy subcategory settings (Windows Vista or later) to override audit policy category settings setting needs to be configured to Enabled. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "scenoapplylegacyauditpolicy", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Audit: Force audit policy subcategory settings (Windows Vista or later) to override audit policy category settings", 
            "active": true
          }
        ], 
        "name": "2.3.2.1 'Audit: Force audit policy subcategory settings to override audit policy category settings'"
      }, 
      {
        "comment": "This policy setting determines whether the system shuts down if it is unable to log Security events. It is a requirement for Trusted Computer System Evaluation Criteria (TCSEC)-C2 and Common Criteria certification to prevent auditable events from occurring if the audit system is unable to log them. Microsoft has chosen to meet this requirement by halting the system and displaying a stop message if the auditing system experiences a failure. When this policy setting is enabled, the system will be shut down if a security audit cannot be logged for any reason.\r\nIf the Audit: Shut down system immediately if unable to log security audits setting is enabled, unplanned system failures can occur. Therefore, this policy setting is configured to Not Defined for both of the environments that are discussed in this chapter. The recommended state for this setting is: Disabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "crashonauditfail", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Audit: Shut down system immediately if unable to log security audits", 
            "active": true
          }
        ], 
        "name": "2.3.2.2 Set 'Audit: Shut down system immediately if unable to log security audits' to 'Disabled'"
      }, 
      {
        "comment": "This policy setting determines who is allowed to format and eject removable media. You can user this policy setting to prevent unauthorized users from removing data on one computer to access it on another computer on which they have local administrator privileges. The recommended state for this setting is: Administrators\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "AllocateDASD", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Devices: Allowed to format and eject removable media", 
            "active": true
          }
        ], 
        "name": "2.3.4.1 Set 'Devices: Allowed to format and eject removable media' to 'Administrators'"
      }, 
      {
        "comment": "This setting determines which users can change the time zone of the computer. This ability holds on great danger for the computer and may be useful for mobile workers. The recommended state for this setting is: Administrators, LOCAL SERVICE. ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators, LOCAL SERVICE", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeTimeZonePrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators, LOCAL SERVICE.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Change the time zone", 
            "active": true
          }
        ], 
        "name": "2.2.10 Set 'Change the time zone' to 'Administrators, LOCAL SERVICE'"
      }, 
      {
        "comment": "This policy setting allows a process to create an acess token, which may provide elevated rights to access sensitive data. \r\nThe recommended state for this setting is: No One. ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeCreateTokenPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the followingGroup Policy setting to No One. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Create a token object", 
            "active": true
          }
        ], 
        "name": "2.2.12 Set 'Create a token object' to 'No One' "
      }, 
      {
        "comment": "This policy setting determines which user accounts will have the right to attach a debugger to any process or to the kernel, which provides complete access to sensitive and critical operating system components. Developers who are debugging their own applications do not need to be assigned this user right; however, developers who are debugging new system components will need it.\r\nNote Microsoft released several security updates in October 2003 that used a version of Update.exe that required the administrator to have the Debug programs user right. Administrators who did not have this user right were unable to install these security updates until they reconfigured their user rights. This is not typical behavior for operating system updates. For more information, see Knowledge Base article 830846: \"Windows Product Updates may stop responding or may use most or all the CPU resources.\"\r\nThe recommended state for this setting is: Administrators.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeDebugPrivilege", 
            "suggestion": "To implement the reommended configuration state, set the following Group Policy setting to Administrators. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Debug programs", 
            "active": true
          }
        ], 
        "name": "2.2.16 Set 'Debug programs' to 'Administrators'"
      }, 
      {
        "comment": "This policy setting determines which accounts will not be able to log on to the cimputer as a batch job. A batch job is not a batch (.bat) file, but rather a batch-queue facility. Accounts that use the Track Scheduler to schedule jobs need this user right. \r\nThe Deny log on as a batch job user right overrides the Log on as a batch job user right, which could be used to allow accounts to schedule jobs that consume excessive system resources. Such an occurrence could cause a DoS condition. Failure to assign this user right to the recommended accounts can be a security risk. \r\nThe recommended state for this setting is to include: Guests. ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Guests ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeDenyBatchLogonRight", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to include Guests.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Deny log on as a batch job", 
            "active": true
          }
        ], 
        "name": " 2.2.18 Set 'Deny log on as a batch job' to include 'Guests' "
      }, 
      {
        "comment": "It is deasible for an attacker to disguise a Trojan horse program as a printer driver. The program may appear to users as if they must use it to print, but such a program could unleash malicious code on your computer network. To reduce the possibility of sucj an event, only administrators should be aloowed to install printer drivers. However, because laptops are mobile devices, laptop users may occasionally need to install a printer driver from a remote source to continue their work. Therefore, this policy setting should be disabled for laptop users, but always enabled for desktop users. The recommended state for this setting is: Enabled ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Print\\Providers\\LanMan Print Services", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "AddPrinterDrivers", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Devices: Prevent users from installing printer drivers", 
            "active": true
          }
        ], 
        "name": "2.3.4.2 Set 'Devices: Prevent users from installing printer drivers' to 'Enabled'"
      }, 
      {
        "comment": "This policy setting determines whether members of the Server Operators group are allowed to submit jobs by means of the AT schedule facility. The impact of this policy setting configuration should be small for most organizations. Users, including those in the Server Operators group, will still be able to create jobs by means of the Task Scheduler Wizard, but those jobs will run in the context of the account with which the user authenticates when they set up the job.\r\nNote: An AT Service Account can be modified to select a different account rather than the LOCAL SYSTEM account. To change the account, open System Tools, click Scheduled Tasks, and then click Accessories folder. Then click AT Service Account on the Advanced menu. The recommended state for this setting is: Disabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa", 
            "expected_data": "0 ", 
            "exportable": true, 
            "value_name": "SubmitControl", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Domain controller: Allow server operators to schedule tasks", 
            "active": true
          }
        ], 
        "name": "2.3.5.1 Set 'Domain controller: Allow server operators to schedule tasks' to 'Disabled'"
      }, 
      {
        "comment": "This policy setting determines whether all secure channel traffic that is initiated by the domain member must be signed or encrypted. If a system is set to always encrypt or sign secure channel data, it cannot establish a secure channel with a domain controller that is not capable of signing or encrypting all secure channel traffic, because all secure channel data must be signed and encrypted.\r\nMicrosoft recommends to configure the Domain member: Digitally encrypt or sign secure channel data (always) setting to Enabled. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\Netlogon\\Parameters", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "requiresignorseal", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Domain member: Digitally encrypt or sign secure channel data (always)", 
            "active": true
          }
        ], 
        "name": "2.3.6.1 Set 'Domain member: Digitally encrypt or sign secure channel data (always)' to 'Enabled' "
      }, 
      {
        "comment": "This policy setting determines whether the Lightweight Directory Access Protocol (LDAP) server requires LDAP clients to negotiate data signing. The recommended state for this setting is: Require signing.\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\NTDS\\Parameters", 
            "expected_data": "2", 
            "exportable": true, 
            "value_name": "ldapserverintegrity", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Require signing.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Domain controller: LDAP server signing requirements", 
            "active": true
          }
        ], 
        "name": "2.3.5.2 Set 'Domain controller: LDAP server signing requirements' to 'Require signing'"
      }, 
      {
        "comment": "This policy setting determines the maximum allowable age for a computer account password. By default, domain members automatically change their domain passwords every 30 days. If you increase this interval significantly or set it to 0 so that the computers no longer change their passwords, an attacker would have more time to undertake a brute force attack against one of the computer accounts. The recommended state for this setting is between 1 and 30 day(s) inclusive. A value of 0 is not conformant with the benchmark as it disables maximum password age.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": false, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "30", 
            "object_type": "local_security_policy_settings", 
            "setting": "MaximumPasswordAge", 
            "suggestion": "", 
            "active": true
          }
        ], 
        "name": " 2.3.6.5 Set 'Domain member: Maximum machine account password age' to 30 or fewer days, but not 0"
      }, 
      {
        "comment": "This policy setting specifies a text message that displays to users when they log on. Configure this setting in a manner that is consistent with the security and operational requirements of your organization. ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "Warning", 
            "exportable": true, 
            "value_name": "LegalNoticeText", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "Configure the following Group Policy setting in a manner that is consistent with the security and operational requirements of your organization. \r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Interactive logon: Message text for users attempting to log on", 
            "active": true
          }
        ], 
        "name": "2.3.7.4 Configure 'Interactive logon: Message text for users attempting to log on'"
      }, 
      {
        "comment": "This security setting determines whether domain controllers will refuse requests from member computers to change computer account passwords. By default, member computers change their computer account passwords every 30 days. If enabled, the domain controller will refuse computer account password change requests.\r\nIf it is enabled, this setting does not allow a domain controller to accept any changes to a computer account's password.\r\nDefault: This policy is not defined, which means that the system treats it as Disabled. The recommended state for this setting is: Disabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\Netlogon\\Parameters", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "RefusePasswordChange", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Domain controller: Refuse machine account password changes", 
            "active": true
          }
        ], 
        "name": "2.3.5.3 Set 'Domain controller: Refuse machine account password changes' to 'Disabled'"
      }, 
      {
        "comment": "This policy setting allows users to change the size of the pagefile. By making the pafefile extremely largo or extremely small, an attacker could easily affect the performance of a compromised computer. The recommended state for this setting is: Administrators. ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeCreatePagefilePrivilege", 
            "suggestion": "To implement the reommended configuration state, set the following Group Policy setting to Administrators. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Create a pagefile", 
            "active": true
          }
        ], 
        "name": " 2.2.11 Set 'Create a pagefile' to 'Administrators'"
      }, 
      {
        "comment": "This policy setting determines whether a domain member should attempt to negotiate encryption for all secure channel traffic that it initiates. If you enable this policy setting, the domain member will request encryption of all secure channel traffic. If you disable this policy setting, the domain member will be prevented from negotiating secure channel encryption. Microsoft recommends to configure the Domain member: Digitally encrypt secure channel data (when possible) setting to Enabled. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\Netlogon\\Parameters", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "sealsecurechannel", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Domain member: Digitally encrypt secure channel data (when possible)", 
            "active": true
          }
        ], 
        "name": "2.3.6.2 Set 'Domain member: Digitally encrypt secure channel data (when possible)' to 'Enabled' "
      }, 
      {
        "comment": "This policy setting determines whether a domain member should attempt to negotiate whether all secure channel traffic that it initiates must be digitally signed. Digital signatures protect the traffic from being modified by anyone who captures the data as it traverses the network.\r\nMicrosoft recommends to configure the Domain member: Digitally sign secure channel data (when possible) setting to Enabled. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\Netlogon\\Parameters", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "signsecurechannel", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Domain member: Digitally sign secure channel data (when possible)", 
            "active": true
          }
        ], 
        "name": "2.3.6.3 Set 'Domain member: Digitally sign secure channel data (when possible)' to 'Enabled'"
      }, 
      {
        "comment": "This setting determines the behavior for inbound connections that do not match an inbound firewall rule. The default behavior is to block connections unless there are firewall rules to allow the connection. The recommended state for this setting is: Block (default)", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\DomainProfile", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "DefaultInboundAction", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Block (default) \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Domain Profile\\Windows Firewall: Domain: Inbound connections", 
            "active": true
          }
        ], 
        "name": "9.1.2 Set 'Windows Firewall: Domain: Inbound connections' to 'Block (default)' "
      }, 
      {
        "comment": "This policy setting determines whether a domain member can periodically change its computer account password. If you enable this policy setting, the domain member will be prevented from changing its computer account password. If you disable this policy setting, the domain member can change its computer account password as specified by the Domain Member: Maximum machine account password age setting, which by default is every 30 days. Computers that cannot automatically change their account passwords are potentially vulnerable, because an attacker might be able to determine the password for the system's domain account. The recommended state for this setting is: Disabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\Netlogon\\Parameters", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "disablepasswordchange", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Domain member: Disable machine account password changes", 
            "active": true
          }
        ], 
        "name": "2.3.6.4 Set 'Domain member: Disable machine account password changes' to 'Disabled'"
      }, 
      {
        "comment": "This setting determines the behavior for outbound connections that do not match an outbound firewall rule. In Windows Vista, the default behavior is to allow connections unless there are firewall rules that block the connection. The recommended state for this setting is: Allow (default)", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\DomainProfile", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "DefaultOutboundAcrion", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Allow (default).\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with AdvancedSecurity\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Domain Profile\\Windows Firewall: Domain: Outbound connections", 
            "active": true
          }
        ], 
        "name": "9.1.3 Set 'Windows Firewall: Domain: Outbound connections' to 'Allow (default)'"
      }, 
      {
        "comment": "Select this option to have Windows Firewall with Advanced Security display notifications to the user when a program is blocked from receiving inbound connections.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\DomainProfile", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "DisableNotifications", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Yes (default).\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Domain Profile\\Windows Firewall: Domain: Display a notification", 
            "active": true
          }
        ], 
        "name": "9.1.4 Set 'Windows Firewall: Domain: Display a notification' to 'Yes (default)' "
      }, 
      {
        "comment": "This option is useful if you need to control whether this computer receives unicast responses to its outgoing multicast or broadcast messages. The recommneded state for this setting is: No. ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\DomainProfile", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "DisableUnicastResponsesToMulticastBroadcast", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to No. \r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Domain Profile\\Windows Firewall: Domain: Allow unicast response", 
            "active": true
          }
        ], 
        "name": "9.1.5 Set 'Windows Firewall: Domain: Allow unicast response' to 'No'"
      }, 
      {
        "comment": "This setting controls whether local administrators are allowed to create local firewall rules that apply together with firewall rules confiugerd by Group Policy. The recommended state for this setting is: Yes (default)\r\n\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\DomainProfile", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "AllowLocalPolicyMerge ", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Yes (default).\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with AdvancedSecurity\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Domain Profile\\Windows Firewall: Domain: Apply local firewall rules", 
            "active": true
          }
        ], 
        "name": "9.1.6 Set 'Windows Firewall: Domain: Apply local firewall rules' to 'Yes (default)'"
      }, 
      {
        "comment": "This setting controls whether local administrators are allowed to create connection security rules that apply together with connection security rules configured by Group Policy. The recommended state for this setting is: Yes (default)", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\DomainProfile", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "AllowLocalIPsecPolicyMerge", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Yes (default)\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Domain Profile\\Windows Firewall: Domain: Apply local connection security rules", 
            "active": true
          }
        ], 
        "name": "9.1.7 Set 'Windows Firewall: Domain: Apply local connection security rules' to 'Yes (default)' "
      }, 
      {
        "comment": "Use this option to specify the path and name of the file in which Windows Firewall will write its log information. The recommended state for this setting is: %SYSTEMROOT%\\System32\\logfiles\\firewall\\domainfw.log.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\DomainProfile\\Logging", 
            "expected_data": "%SYSTEMROOT%\\System32\\logfiles\\firewall\\domainfw.log", 
            "exportable": true, 
            "value_name": "LogFilePath", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to %SYSTEMROOT%\\System32\\logfiles\\firewall\\domainfw.log.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Domain Profile\\Logging\\Windows Firewall: Domain: Logging: Name", 
            "active": true
          }
        ], 
        "name": "9.1.8 Set 'Windows Firewall: Domain: Logging: Name'"
      }, 
      {
        "comment": "Use this option to specify the size limit of the file in which Windows Firewall will write its log information. The recommended state for this setting is: 16,384 KB or greater", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\DomainProfile\\Logging", 
            "expected_data": "> 16383", 
            "exportable": true, 
            "value_name": "LogfileSize ", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to 16,384 KB or greater.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Domain Profile\\Logging\\Windows Firewall: Domain: Logging: Size limit (KB)", 
            "active": true
          }
        ], 
        "name": " 9.1.9 Set 'Windows Firewall: Domain: Logging: Size limit (KB)' to '16,384 KB or greater ' "
      }, 
      {
        "comment": "Use this option to log when Windows Firewall with Advanced Security discards an inbound packet for any reason. The log records why and when the packet was dropped. Look for entries with the word DROP in the action column of the log. the recommended stae for this setting is: Yes", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\DomainProfile\\Logging", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "LogDroppedPackets", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Yes. \r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Domain Profile\\Logging\\Windows Firewall: Domain: Logging: Log dropped packets", 
            "active": true
          }
        ], 
        "name": "9.1.10 Set 'Windows Firewall: Domain: Logging: Log dropped packets' to 'Yes' "
      }, 
      {
        "comment": "Use this option to log when Windows Firewall with Advanced Security allows an inbound connection. The log reocrds why and when the connection was formed. Look for entries with the word ALLOW in the action column of the log. The recommended state for this setting is: Yes ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\DomainProfile\\Logging", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "LogSuccessfulConnections", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Yes. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Domain\r\nProfile\\Logging\\Windows Firewall: Domain: Logging: Log successful connections", 
            "active": true
          }
        ], 
        "name": "9.1.11 Set 'Windows Firewall: Domain: Logging: Log successful connections' to 'Yes'"
      }, 
      {
        "comment": "Select On (recomended) to have Windows Firewall with Advanced Security use the settings for this profile to filter network traffic. If you select Off, Windows Firewall with Advaned Security will not use any of the firewall rules or connection security rules for this profile. The recommended state for this setting is: On (recommended) \r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "EnableFirewall", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to On (recommended).\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Private Profile\\Windows Firewall: Private: Firewall state", 
            "active": true
          }
        ], 
        "name": "9.2.1 Set 'Windows Firewall: Private: Firewall state' to 'On (recommended)'"
      }, 
      {
        "comment": "This settting determines the behavior for inbound connections that do not match an inbound firewall rule. The default behavior is to block connections unless there are firewall rules to allow the connection. The recommended state for this setting is: Block (default)", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "DeafultInboundAcrion", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Block (default) \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Private Profile\\Windows Firewall: Private: Inbound connections", 
            "active": true
          }
        ], 
        "name": "9.2.2 Set 'Windows Firewall: Private: Inbound connections' to 'Block (default)' "
      }, 
      {
        "comment": "This option is useful if you need to control whether this computer receives unicast responses to its outgoing multicast or broadcast messages. The recommended state for this setting is: No.\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "DisableUnicastResponsesToMulticastBroadcast", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to No.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Public Profile\\Windows Firewall: Public: Allow unicast response\r\n", 
            "active": true
          }
        ], 
        "name": " 9.3.5 Set 'Windows Firewall: Public: Allow unicast response' to 'No'"
      }, 
      {
        "comment": "When this policy setting is enabled, a secure channel can only be established with domain controllers that are capable of encrypting secure channel data with a strong (128-bit) session key.\r\nTo enable this policy setting, all domain controllers in the domain must be able to encrypt secure channel data with a strong key, which means all domain controllers must be running Microsoft Windows 2000 or later. If communication to non-Windows 2000based domains is required, it is recommended that you disable this policy setting. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\Netlogon\\Parameters", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "requirestrongkey", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Domain member: Require strong (Windows 2000 or later) session key", 
            "active": true
          }
        ], 
        "name": "2.3.6.6 Set 'Domain member: Require strong (Windows 2000 or later) session key' to 'Enabled'"
      }, 
      {
        "comment": "This setting determines the behavior for outbound connections that do not match an outbound firewall rule. The default behavior is to allow connections unless there are firewall rules that block the connection.\r\nImportant If you set Outbound connections to Block and then deploy the firewall policy by using a GPO, computers that receive the GPO settings cannot receive subsequent Group Policy updates unless you create and deploy an outbound rule that enables Group Policy to work. Predefined rules for Core Networking include outbound rules that enable Group Policy to work. Ensure that these outbound rules are active, and thoroughly test firewall profiles before deploying. The recommended state for this setting is: Allow (default).", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "DefaultOutboundAction", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Allow (default)\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Private Profile\\Windows Firewall: Private: Outbound connections", 
            "active": true
          }
        ], 
        "name": "9.2.3 Set 'Windows Firewall: Private: Outbound connections' to 'Allow (default)'"
      }, 
      {
        "comment": "This policy setting determines whether the account name of the last user to log on to the client computers in your organization will  be displayed in each computer's respective Windows logon screen. Enable this policy setting to prevent intruders from collecting account names visually from the screens of desktop or laptop computers in your organization. The recommended state for this setting is: Enabled", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "DontDisplayLAstUserName", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy settign to Enabled. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Interactive logon: Do not display last user name", 
            "active": true
          }
        ], 
        "name": "2.3.7.1 Set 'Interactive logon: Do not display last user name' to 'Enabled'"
      }, 
      {
        "comment": "This policy setting determins whether users must press CTRL+ALT+DEL before they log on. If you enable this policy setting, users can log on without this key combination. If you disable this policy setting, users must press CTRL+ALT+DEL before they log on to Windows unless they use a smart card for Windows logon. A smart card is a tamper-proof device that stores security information. The recommended state for this setting is: Disabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "DisableCAD", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Interactive logon: Do not require CTRL+ALT+DEL", 
            "active": true
          }
        ], 
        "name": " 2.3.7.2 Set 'Interactive logon: Do not require CTRL+ALT+DEL' to 'Disabled'"
      }, 
      {
        "comment": "Select this option to have Windows Firewall with Advanced Security display notifications to the user when a program is blocked from receiving inbound connections.\r\nNote: When the Apply local firewall rules setting is configured to No, it's recommended to also also configure the Display a notification setting to No. Otherwise, users will continue to receive messages that ask if they want to unblock a restricted inbound connection, but the user's response will be ignored. The recommended state for this setting is: Yes (default).", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "DisableNotifications", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Yes (default)\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Private Profile\\Windows Firewall: Private: Display a notification", 
            "active": true
          }
        ], 
        "name": "9.2.4 Set 'Windows Firewall: Private: Display a notification' to 'Yes (default)'"
      }, 
      {
        "comment": "Windows notices inactivity of a logon session, and if the amount of inactive time exceeds the inactivity limit, then the screen saver will run, locking the session. The recommended state for this setting is 900 seconds or fewer. A value of 0 is not conformant with the benchmark as it enforces no inactivity limit. \r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "< 901", 
            "exportable": true, 
            "value_name": "InactivityTimeoutSecs", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to 900 or fewer seconds. A value of 0 is not conformant with the benchmark as it enforces no inactivity limit.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Interactive logon: Machine inactivity limit", 
            "active": true
          }
        ], 
        "name": "2.3.7.3 Set 'Interactive logon: Machine inactivity limit' to 900 or fewer second(s), but not 0"
      }, 
      {
        "comment": "This option is useful if you need to control whether this computer receives unicast responses to its outgoing multicast or broadcast messages. The recommended state for this setting is: No.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "DisableUnicastResponsesToMulticastBroadcast", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to No.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Private Profile\\Windows Firewall: Private: Allow unicast response", 
            "active": true
          }
        ], 
        "name": " 9.2.5 Set 'Windows Firewall: Private: Allow unicast response' to 'No'"
      }, 
      {
        "comment": "This setting controls whether local administrators are allowed to create connection security rules that apply together with connection security rules configured by Group Policy. The recommended state for this setting is: Yes (default) ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "AllowLocalIPsecPolicyMerge", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Yes (default)\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Private Profile\\Windows Firewall: Private: Apply local connection security rules", 
            "active": true
          }
        ], 
        "name": "9.2.7 Set 'Windows Firewall: Private: Apply local connection security rules' to 'Yes (default)' "
      }, 
      {
        "comment": "This ppolicy setting allows text to be specified in the title bar of the window that users see when they log on to the system. Configure this setting in a manner that is consistent with the security and operational requirements of your organization", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "!!!WARN!!!", 
            "exportable": true, 
            "value_name": "LegalNoticeCaption", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "Configure the following Group Policy setting in a manner that is consistent with the security and operational requirements of your organization:\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Interactive logon: Message title for users attempting to log on", 
            "active": true
          }
        ], 
        "name": "2.3.7.5 Configure 'Interactive logon: Message title for users attempting to log on'"
      }, 
      {
        "comment": "This policy setting determines whether packet signing is required by the SMB client component. If you enable this policy setting, the Microsoft network client computer cannot communicate with a Microsoft network server unless that server agrees to sign SMB packets. In mixed environments with legacy client computers, set this option to Disabled because these computers will not be able to authenticate or gain access to domain controllers. However, you can use this policy setting in Windows 2000 or later environments.\r\nNote When Windows Vistabased computers have this policy setting enabled and they connect to file or print shares on remote servers, it is important that the setting is synchronized with its companion setting, Microsoft network server: Digitally sign communications (always), on those servers. For more information about these settings, see the \"Microsoft network client and server: Digitally sign communications (four related settings)\" section in Chapter 5 of the Threats and Countermeasures guide. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\LanmanWorkstation\\Parameters", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "RequireSecuritySignature", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Microsoft network client: Digitally sign communications (always)", 
            "active": true
          }
        ], 
        "name": "2.3.8.1 Set 'Microsoft network client: Digitally sign communications (always)' to 'Enabled' "
      }, 
      {
        "comment": "This policy setting determines whether a user can log on to a Windows domain using cached account information. Logon information for domain accounts can be cached locally to allow users to log on even if a domain controller cannot be contacted. This policy setting determines the number of unique users for whom logon information is cached locally. If this value is set to 0, the logon cache feature is disabled. An attacker who is able to access the file system of the server could locate this cached information and use a brute force attack to determine user passwords. The recommended state for this setting is: 4 or fewer logon(s).", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon", 
            "expected_data": "< 4", 
            "exportable": true, 
            "value_name": "cachedlogonscount", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to 4 or fewer logon(s).\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Interactive logon: Number of previous logons to cache (in case domain controller\r\nis not available)", 
            "active": true
          }
        ], 
        "name": " 2.3.7.6 Set 'Interactive logon: Number of previous logons to cache' to '4 or fewer logon(s)'"
      }, 
      {
        "comment": "This setting controls whether local administrators are allowed to create local firewall rules that apply together with firewall rules configured by Group Policy. The recommended state for this setting is: Yes (default) \r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "AllowLocalPolicyMerge", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Yes.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Private Profile\\Windows Firewall: Private: Apply local firewall rules", 
            "active": true
          }
        ], 
        "name": "9.2.6 Set 'Windows Firewall: Private: Apply local firewall rules' to 'Yes (default)'"
      }, 
      {
        "comment": "This policy setting determines how far in advance users are warned that their password will expire. It is recommended that you configure this policy setting to at least 5 days but no more than 14 days to sufficiently warn users when their passwords will expire. The recommended state for this setting is between 5 and 14 days ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\r\nNT\\CurrentVersion\\Winlogon ", 
            "expected_data": "> 4 ", 
            "exportable": true, 
            "value_name": "passwordexpirywarning", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to between 5 and 14 day(s).\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Interactive logon: Prompt user to change password before expiration", 
            "active": true
          }, 
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\r\nNT\\CurrentVersion\\Winlogon ", 
            "expected_data": "< 15", 
            "exportable": true, 
            "value_name": "passwordexpirywarning", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to between 5 and 14 day(s).\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Interactive logon: Prompt user to change password before expiration", 
            "active": true
          }
        ], 
        "name": "2.3.7.7 Set 'Interactive logon: Prompt user to change password before expiration' "
      }, 
      {
        "comment": "Use this option to specify the path and name of the file in which Windows Firewall will write its log information. The recommended state for this setting is: \r\n%SYSTEMROOT%\\System32\\logfiles\\firewall\\privatefw.log", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile\\Logging", 
            "expected_data": "%SYSTEMROOT%\\System32\\logfiles\\firewall\\privatefw.log", 
            "exportable": true, 
            "value_name": "LogFilePath", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to %SYSTEMROOT%\\System32\\logfiles\\firewall\\privatefw.log\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with AdvancedSecurity\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Private Profile\\Logging\\Windows Firewall: Private: Logging: Name", 
            "active": true
          }
        ], 
        "name": "9.2.8 Set 'Windows Firewall: Private: Logging: Name' "
      }, 
      {
        "comment": "Use this option to specify the size limit of the file in which Windows Firewall will write its log information. The recommended state for this setting is: 16,384 KB or greater.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile\\Logging", 
            "expected_data": "> 16383", 
            "exportable": true, 
            "value_name": "LogFileSize", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to 16,384 KB or greater.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Private Profile\\Logging\\Windows Firewall: Private: Logging: Size limit (KB)", 
            "active": true
          }
        ], 
        "name": "9.2.9 Set 'Windows Firewall: Private: Logging: Size limit (KB)' to '16,384 KB or greater' "
      }, 
      {
        "comment": "Use this option to log when Windows Firewall with Advanced Security discards an inbound packet for any reason. The log records why and when the packet was dropped. Look for entries with the word DROP in the action column of the log. The recommended state for this setting is: Yes.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile\\Logging", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "LogDroppedPackets", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Yes.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Private Profile\\Logging\\Windows Firewall: Private: Logging: Log dropped packets", 
            "active": true
          }
        ], 
        "name": "9.2.10 Set 'Windows Firewall: Private: Logging: Log dropped packets' to 'Yes' "
      }, 
      {
        "comment": "Use this option to log when Windows Firewall with Advanced Security allows an inbound connection. The log records why and when the connection was formed. Look for entries with the word ALLOW in the action column of the log. The recommended state for this setting is: Yes.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile\\Logging", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "LogSuccessfulConnections", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Yes.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Private Profile\\Logging\\Windows Firewall: Private: Logging: Log successful connections", 
            "active": true
          }
        ], 
        "name": "9.2.11 Set 'Windows Firewall: Private: Logging: Log successful connections' to 'Yes' "
      }, 
      {
        "comment": "Select On (recommended) to have Windows Firewall with Advanced Security use the settings for this profile to filter network traffic. If you select Off, Windows Firewall with Advanced Security will not use any of the firewall rules or connection security rules for this profile. The recommended state for this setting is: On (recommended).", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "EnableFirewall", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to On (recommended).\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Public Profile\\Windows Firewall: Public: Firewall state", 
            "active": true
          }
        ], 
        "name": " 9.3.1 Set 'Windows Firewall: Public: Firewall state' to 'On (recommended)'"
      }, 
      {
        "comment": "This setting determines the behavior for inbound connections that do not much an inbound firewall rule. The default behavior is to block connections unless there are firewall rules to allow to connection. The recommended state for this setting is: Block (default)", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "DefaultInboundAction", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Block (default).\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Public Profile\\Windows Firewall: Public: Inbound connections", 
            "active": true
          }
        ], 
        "name": "9.3.2 Set 'Windows Firewall: Public: Inbound connections' to 'Block (default)'"
      }, 
      {
        "comment": "This setting determines the behavior for outbound connections that do not match an outbound firewall rule. The default behavior is to allow connections unless there are firewall rules that block the connection.\r\nImportant If you set Outbound connections to Block and then deploy the firewall policy by using a GPO, computers that receive the GPO settings cannot receive subsequent Group Policy updates unless you create and deploy an outbound rule that enables Group Policy to work. Predefined rules for Core Networking include outbound rules that enable Group Policy to work. Ensure that these outbound rules are active, and thoroughly test firewall profiles before deploying. The recommended state for this setting is: Allow (default).\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "DefaultOutboundAction", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Allow (default)\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Public Profile\\Windows Firewall: Public: Outbound connections", 
            "active": true
          }
        ], 
        "name": "9.3.3 Set 'Windows Firewall: Public: Outbound connections' to 'Allow (default)'"
      }, 
      {
        "comment": "Select this option to have Windows Firewall with Advanced Security display notifications to the user when a program is blocked from receiving inbound connections.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "DisableNotifications", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Yes\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Public Profile\\Windows Firewall: Public: Display a notification", 
            "active": true
          }
        ], 
        "name": "9.3.4 Set 'Windows Firewall: Public: Display a notification' to 'Yes' "
      }, 
      {
        "comment": "This setting controls whether local administrators are allowed to create local firewall rules that apply together with firewall rules configured by Group Policy. The recommended state for this setting is: Yes (default).", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "AllowLocalPolicyMerge ", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Yes (default).\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Public Profile\\Windows Firewall: Public: Apply local firewall rules", 
            "active": true
          }
        ], 
        "name": "9.3.6 Set 'Windows Firewall: Public: Apply local firewall rules' to 'Yes (default)' "
      }, 
      {
        "comment": "This policy setting determines whether users can create global objects that are available to all sessions. Users can still create objects that are specific to their own session if they do not have this user right.\r\nUsers who can create global objects could affect processes that run under other users' sessions. This capability could lead to a variety of problems, such as application failure or data corruption.\r\nThe recommended state for this setting is: Administrators, LOCAL SERVICE, NETWORK SERVICE, SERVICE.\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators, LOCAL SERVICE, NETWORK SERVICE, SERVICE", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeCreateGlobalPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators, LOCAL SERVICE, NETWORK SERVICE, SERVICE.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Create global objects", 
            "active": true
          }
        ], 
        "name": "2.2.13 Set 'Create global objects' to 'Administrators, LOCAL SERVICE, NETWORK SERVICE, SERVICE'"
      }, 
      {
        "comment": "This setting controls whether local administrators are allowed to create connection security rules that apply together with connection security rules configured by Group Policy. The recommended state for this setting is: No.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "AllowLocalIPsecPolicyMerge", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to No.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Public Profile\\Windows Firewall: Public: Apply local connection security rules", 
            "active": true
          }
        ], 
        "name": "9.3.7 Set 'Windows Firewall: Public: Apply local connection security rules' to 'No'"
      }, 
      {
        "comment": "Use this option to specify the path and name of the file in which Windows Firewall will write its log information. The recommended state for this setting is: %SYSTEMROOT%\\System32\\logfiles\\firewall\\publicfw.log.\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile\\Logging", 
            "expected_data": "%SYSTEMROOT%\\System32\\logfiles\\firewall\\publicfw.log", 
            "exportable": true, 
            "value_name": "LogFilePath", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "Computer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Public Profile\\Logging\\Windows Firewall: Public: Logging: Name", 
            "active": true
          }
        ], 
        "name": " 9.3.8 Set 'Windows Firewall: Public: Logging: Name'"
      }, 
      {
        "comment": "Use this option to specify the size limit of the file in which Windows Firewall will write its log information. The recommended state for this setting is: 16,384 KB or greater.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile\\Logging", 
            "expected_data": "> 16383", 
            "exportable": true, 
            "value_name": "LogFileSize", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to 16,384 KB or greater\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Public Profile\\Logging\\Windows Firewall: Public: Logging: Size limit (KB)", 
            "active": true
          }
        ], 
        "name": "9.3.9 Set 'Windows Firewall: Public: Logging: Size limit (KB)' to '16,384 KB or greater' "
      }, 
      {
        "comment": "Use this option to log when Windows Firewall with Advanced Security discards an inbound packet for any reason. The log records why and when the packet was dropped. Look for entries with the word DROP in the action column of the log. The recommended state for this setting is: Yes.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile\\Logging", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "LogDroppedPackets", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Yes.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Public Profile\\Logging\\Windows Firewall: Public: Logging: Log dropped packets", 
            "active": true
          }
        ], 
        "name": "9.3.10 Set 'Windows Firewall: Public: Logging: Log dropped packets' to 'Yes' "
      }, 
      {
        "comment": "Use this option to log when Windows Firewall with Advanced Security allows an inbound connection. The log records why and when the connection was formed. Look for entries with the word ALLOW in the action column of the log. The recommended state for this setting is: Yes.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile\\Logging", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "LogSuccessfulConnections", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Yes\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Windows Firewall with Advanced Security\\Windows Firewall with Advanced Security\\Windows Firewall Properties\\Public Profile\\Logging\\Windows Firewall: Public: Logging: Log successful connections", 
            "active": true
          }
        ], 
        "name": "9.3.11 Set 'Windows Firewall: Public: Logging: Log successful connections' to 'Yes' "
      }, 
      {
        "comment": "This policy setting determines what happens when the smart card for a logged-on user is removed from the smart card reader. The recommended state for this setting is: Lock Workstation. Configuring this setting to Force Logoff or Disconnect if a Remote Desktop Services session is also in conformance with the benchmark.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "scremoveoption", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Lock Workstation.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Interactive logon: Smart card removal behavior", 
            "active": true
          }
        ], 
        "name": "2.3.7.8 Set 'Interactive logon: Smart card removal behavior' to 'Lock Workstation'"
      }, 
      {
        "comment": "This policy setting determines whether the SMB client will attempt to negotiate SMB packet signing. The implementation of digital signing in Windowsbased networks helps to prevent sessions from being hijacked. If you enable this policy setting, the Microsoft network client will use signing only if the server with which it communicates accepts digitally signed communication.\r\nMicrosoft recommends to enable The Microsoft network client: Digitally sign communications (if server agrees) setting.\r\nNote Enabling this policy setting on SMB clients on your network makes them fully effective for packet signing with all clients and servers in your environment. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\LanmanWorkstation\\Parameters", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "EnableSecuritySignature", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Microsoft network client: Digitally sign communications (if server agrees)", 
            "active": true
          }
        ], 
        "name": " 2.3.8.2 Set 'Microsoft network client: Digitally sign communications (if server agrees)' "
      }, 
      {
        "comment": "Disable this policy setting to prevent the SMB redirector from sending plaintext passwords during authentication to third-part SMB servers that do not support password encryption.  It is recommended that you disable this policy setting unless there is a strong business case to enable it. If this policy setting is enabled, unencrypted passwords will be allowed across the network. The recommended state for this setting is: Disabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\LanmanWorkstation\\Parameters", 
            "expected_data": "0 ", 
            "exportable": true, 
            "value_name": "EnablePlainTextPassword", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the reommended configuration state, set the following Group Policy setting to Disabled. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Microsoft network client: Send unencrypted password to third-party SMB servers", 
            "active": true
          }
        ], 
        "name": "2.3.8.3 Set 'Microsoft network client: Send unencrypted password to third- party SMB servers' "
      }, 
      {
        "comment": "This policy setting allows you to specify the amount of continuous idle time that must pass in an SMB session before the session is suspended because of inactivity. Administrators can use this policy setting to control when a computer suspends an inactive SMB session. If client activity resumes, the session is automatically reestablished.\r\nA value of 0 will disconnect an idle session as quickly as possible. The maximum value is 99999, which is 208 days; in effect, this value disables the setting. The recommended state for this setting is: 15 or fewer minute(s).", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\LanManServer\\Parameters", 
            "expected_data": "< 16", 
            "exportable": true, 
            "value_name": "autodisconnect", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to 15 or fewer minute(s).\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Microsoft network server: Amount of idle time required before suspending session", 
            "active": true
          }
        ], 
        "name": "2.3.9.1 Set 'Microsoft network server: Amount of idle time required before suspending session'"
      }, 
      {
        "comment": "This policy setting determines if the server side SMB service is required to perform SMB packet signing. Enable this policy setting in a mixed environment to prevent downstream clients from using the workstation as a network server. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\LanManServer\\Parameters", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "requiresecuritysignature", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Microsoft network server: Digitally sign communications (always)", 
            "active": true
          }
        ], 
        "name": "2.3.9.2 Set 'Microsoft network server: Digitally sign communications (always)' to 'Enabled'"
      }, 
      {
        "comment": "This policy setting determines if the server side SMB service is able to sign SMB packets if it is requested to do so by a client that attempts to establish a connection. If no signing request comes from the client, a connection will be allowed without a signature if the Microsoft network server: Digitally sign communications (always) setting is not enabled.\r\nNote Enable this policy setting on SMB clients on your network to make them fully effective for packet signing with all clients and servers in your environment. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\LanManServer\\Parameters", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "enablesecuritysignature", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security\r\nOptions\\Microsoft network server: Digitally sign communications (if client agrees)", 
            "active": true
          }
        ], 
        "name": "2.3.9.3 Set 'Microsoft network server: Digitally sign communications (if client agrees)' to 'Enabled"
      }, 
      {
        "comment": "This policy setting determines whether to disconnect users who are connected to the local computer outside their user account's valid logon hours. It affects the SMB component. If you enable this policy setting, client sessions with the SMB service will be forcibly disconnected when the client's logon hours expire. If you disable this policy setting, established client sessions will be maintained after the client's logon hours expire. If you enable this policy setting you should also enable Network security: Force logoff when logon hours expire.\r\nIf your organization configures logon hours for users, it makes sense to enable this policy setting. The recommended state for this setting is: Enabled.\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\LanManServer\\Parameters", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "enableforcedlogoff", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Microsoft network server: Disconnect clients when logon hours expire", 
            "active": true
          }
        ], 
        "name": "2.3.9.4 Set 'Microsoft network server: Disconnect clients when logon hours expire' to 'Enabled'"
      }, 
      {
        "comment": "This policy setting determines which users can create symbolic links. In Windows Vista, existing NTFS file system objects, such as files and folders, can be accessed by referring to a new kind of file system object called a symbolic link. A symbolic link is a pointer (much like a shortcut or .lnk file) to another file system object, which can be a file, folder, shortcut or another symbolic link. The difference between a shortcut and a symbolic link is that a shortcut only works from within the Windows shell. To other programs and applications, shortcuts are just another file, whereas with symbolic links, the concept of a shortcut is implemented as a feature of the NTFS file system.\r\nSymbolic links can potentially expose security vulnerabilities in applications that are not designed to use them. For this reason, the privilege for creating symbolic links should only be assigned to trusted users. By default, only Administrators can create symbolic links.\r\nThe recommended state for this setting is: Administrators.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeCreateSymbolicLinkPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Create symbolic links", 
            "active": true
          }
        ], 
        "name": "2.2.15 Set 'Create symbolic links' to 'Administrators'"
      }, 
      {
        "comment": "This policy setting prohibits users from connecting to a computer from across the network, which would allow users to access and potentially modify data remotely. In high security environments, there should be no need for remote users to access data on a computer. Instead, file sharing should be accomplished through the use of network servers.\r\n\r\nLevel 1 - Domain Controller. The recommended state for this setting is to include: Guests, Local account.\r\n\r\nLevel 1 - Member Server. The recommended state for this setting is to include: Guests, Local account and member of Administrators group.\r\n\r\nCaution: Configuring a standalone server as described above may result in an inability to remotely administer the server.\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Guests, Local account ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeDenyNetworkLogonRight", 
            "suggestion": "To implement the reommended configuration state, set the following Group Policy setting:\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Deny access to this computer from the network", 
            "active": true
          }
        ], 
        "name": "2.2.17 Set 'Deny access to this computer from the network'"
      }, 
      {
        "comment": "This security setting determines which service accounts are prevented from registering a process as service. This policy setting supersedes the Log on as a service policy setting if an account is subject to both policies. Note: This security setting does not apply to System, Local Service, or Network Service accounts.\r\nThe recommended state for this setting is to include: Guests. ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Guests ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeDenyServiceLogonRight", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to include Guests.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Deny log on as a service", 
            "active": true
          }
        ], 
        "name": " 2.2.19 Set 'Deny log on as a service' to include 'Guests'"
      }, 
      {
        "comment": "This security setting determines which users are prevented from logging on at the computer. This policy setting supersedes the Allow log on locally policy setting if an account is subject to both policies.Important:If you apply this security policy to the Everyone group, no one will be able to log on locally.\r\nThe recommended state for this setting is to include: Guests.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Guests ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeDenyInteractiveLogonRight", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to include: Guests.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Deny log on locally", 
            "active": true
          }
        ], 
        "name": " 2.2.20 Set 'Deny log on locally' to include 'Guests'"
      }, 
      {
        "comment": "This policy setting determines whether users can log on as Terminal Services clients. After the baseline member server is joined to a domain environment, there is no need to use local accounts to access the server from the network. Domain accounts can access the server for administration and end-user processing. The recommended state for this setting is to include: Guests, Local account.\r\nCaution: Configuring a standalone server as described above may result in an inability to remotely administer the server.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Guests, Local account", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeDenyRemoteInteractiveLogonRight", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to include Guests, Local account.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Deny log on through Remote Desktop Services", 
            "active": true
          }
        ], 
        "name": "2.2.21 Set 'Deny log on through Remote Desktop Services' to include 'Guests, Local account'"
      }, 
      {
        "comment": "This policy setting determines whether users can increase the base priority class of a process. (It is not a privileged operation to increase relative priority within a priority class.) This user right is not required by administrative tools that are supplied with the operating system but might be required by software development tools.\r\nThe recommended state for this setting is: Administrators.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeIncreaseBasePriorityPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Increase scheduling priority\r\n", 
            "active": true
          }
        ], 
        "name": " 2.2.26 Set 'Increase scheduling priority' to 'Administrators'"
      }, 
      {
        "comment": "This policy setting allows users to change the Trusted for Delegation setting on a computer object in Active Directory. Abuse of this privilege could allow unauthorized users to impersonate other users on the network.\r\nLevel 1 - Domain Controller. The recommended state for this setting is: Administrators.\r\nLevel 1 - Member Server. The recommended state for this setting is: No One.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeEnableDelegationPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting:\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Enable computer and user accounts to be trusted for delegation", 
            "active": true
          }
        ], 
        "name": "2.2.22 Set 'Enable computer and user accounts to be trusted for delegation'"
      }, 
      {
        "comment": "This policy setting determines which users or processes can generate audit records in the Security log.\r\nThe recommended state for this setting is: LOCAL SERVICE, NETWORK SERVICE.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "LOCAL SERVICE, NETWORK SERVICE", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeAuditPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to LOCAL SERIVCE, NETWORK SERVICE.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Generate security audits", 
            "active": true
          }
        ], 
        "name": "2.2.24 Set 'Generate security audits' to 'LOCAL SERVICE, NETWORK SERVICE' "
      }, 
      {
        "comment": "This policy setting allows users to shut down Windows Vistabased computers from remote locations on the network. Anyone who has been assigned this user right can cause a denial of service (DoS) condition, which would make the computer unavailable to service user requests. Therefore, it is recommended that only highly trusted administrators be assigned this user right.\r\nThe recommended state for this setting is: Administrators.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeRemoteShutdownPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Force shutdown from a remote system", 
            "active": true
          }
        ], 
        "name": "2.2.23 Set 'Force shutdown from a remote system' to 'Administrators'"
      }, 
      {
        "comment": "This policy setting controls the level of validation a computer with shared folders or printers (the server) performs on the service principal name (SPN) that is provided by the client computer when it establishes a session using the server message block (SMB) protocol.\r\nThe server message block (SMB) protocol provides the basis for file and print sharing and other networking operations, such as remote Windows administration. The SMB protocol supports validating the SMB server service principal name (SPN) within the authentication blob provided by a SMB client to prevent a class of attacks against SMB servers referred to as SMB relay attacks. This setting will affect both SMB1 and SMB2.\r\nThis security setting determines the level of validation a SMB server performs on the service principal name (SPN) provided by the SMB client when trying to establish a session to an SMB server. The recommended state for this setting is: Accept if provided by client. Configuring this setting to Required from client also conforms with the benchmark.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\LanManServer\\Parameters", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "SMBServerNameHardeningLevel", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Accept if provided by client.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Microsoft network server: Server SPN target name validation level", 
            "active": true
          }
        ], 
        "name": "2.3.9.5 Set 'Microsoft network server: Server SPN target name validation level' "
      }, 
      {
        "comment": "The registry value entry AutoAdminLogon was added to the template file in the HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\ registry key. The entry appears as MSS: (AutoAdminLogon) Enable Automatic Logon (not recommended) in the Security Configuration Editor.\r\nThis setting is separate from the Welcome screen feature in Windows XP and Windows Vista; if that feature is disabled, this setting is not disabled. If you configure a computer for automatic logon, anyone who can physically gain access to the computer can also gain access to everything that is on the computer, including any network or networks to which the computer is connected. Also, if you enable automatic logon, the password is stored in the registry in plaintext, and the specific registry key that stores this value is remotely readable by the Authenticated Users group.\r\nFor additional information, see the Knowledge Base article 315231, \"How to turn on automatic logon in Windows XP.\" The recommended state for this setting is: Disabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "AutoAdminLogon", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\MSS: (AutoAdminLogon) Enable Automatic Logon (not recommended)", 
            "active": true
          }
        ], 
        "name": "2.3.10.1 Set 'MSS: (AutoAdminLogon) Enable Automatic Logon (not recommended)' to 'Disabled' "
      }, 
      {
        "comment": "This entry appears as MSS: (DisableIPSourceRouting) IPv6 source routing protection level (protects against packet spoofing) in the SCE.IP source routing is a mechanism that allows the sender to determine the IP route that a datagram should follow through the network. The recommended state for this setting is: Highest protection, source routing is completely disabled", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\Tcpip6\\Parameters", 
            "expected_data": "2", 
            "exportable": true, 
            "value_name": "DisableIPSourceRouting", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Highest protection, source routing is completely disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\MSS: (DisableIPSourceRouting IPv6) IP source routing protection level (protects\r\nagainst packet spoofing)", 
            "active": true
          }
        ], 
        "name": " 2.3.10.2 Set 'MSS: (DisableIPSourceRouting IPv6) IP source routing protection level"
      }, 
      {
        "comment": "The registry value entry DisableIPSourceRouting was added to the template file in the HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\Tcpip\\Parameters\\ registry key. The entry appears as MSS: (DisableIPSourceRouting) IP source routing protection level (protects against packet spoofing) in the SCE. IP source routing is a mechanism that allows the sender to determine the IP route that a datagram should take through the network. It is recommended to configure this setting to Not Defined for enterprise environments and to Highest Protection for high security environments to completely disable source routing. The recommended state for this setting is: Highest protection, source routing is completely disabled.\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\Tcpip\\Parameters", 
            "expected_data": "2 ", 
            "exportable": true, 
            "value_name": "DisableIPSourceRouting", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Highest protection, source routing is completely disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\MSS: (DisableIPSourceRouting) IP source routing protection level (protects against packet spoofing)", 
            "active": true
          }
        ], 
        "name": "2.3.10.3 Set 'MSS: (DisableIPSourceRouting) IP source routing protection level'"
      }, 
      {
        "comment": "The registry value entry SafeDllSearchMode was added to the template file in the HKEY_LOCAL_MACHINE\\ SYSTEM\\CurrentControlSet\\Control\\Session Manager\\ registry key. The entry appears as MSS: (SafeDllSearchMode) Enable Safe DLL search mode (recommended) in the SCE.\r\nThe DLL search order can be configured to search for DLLs that are requested by running processes in one of two ways:\r\n- Search folders specified in the system path first, and then search the current working folder. - Search current working folder first, and then search the folders specified in the system path. When enabled, the registry value is set to 1. With a setting of 1, the system first searches the folders that are specified in the system path and then searches the current working folder. When disabled the registry value is set to 0 and the system first searches the current working folder and then searches the folders that are specified in the system path. The recommended state for this setting is: Enabled.\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Session Manager", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "SafeDllSearchMode", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\MSS: (SafeDllSearchMode) Enable Safe DLL search mode (recommended)", 
            "active": true
          }
        ], 
        "name": "2.3.10.4 Set 'MSS: (SafeDllSearchMode) Enable Safe DLL search mode (recommended)' to 'Enabled' "
      }, 
      {
        "comment": "Windows includes a grace period between when the screen saver is launched and when the console is actually locked automatically when screen saver locking is enabled. The recommended state for this setting is: 5 or fewer seconds.\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon", 
            "expected_data": "< 6", 
            "exportable": true, 
            "value_name": "ScreenSaveGracePeriod", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to 5 or fewer seconds.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\MSS: (ScreenSaverGracePeriod) The time in seconds before the screen saver grace\r\nperiod expires (0 recommended)", 
            "active": true
          }
        ], 
        "name": "2.3.10.5 Set 'MSS:The time in seconds before the screen saver grace period expires'"
      }, 
      {
        "comment": "The registry value entry WarningLevel was added to the template file in the HKEY_LOCAL_MACHINE\\ SYSTEM\\CurrentControlSet\\Services\\Eventlog\\Security\\ registry key. The entry appears as MSS: (WarningLevel) Percentage threshold for the security event log at which the system will generate a warning in the SCE. This setting can generate a security audit in the Security event log when the log reaches a user-defined threshold. Note If log settings are configured to Overwrite events as needed or Overwrite events older than x days, this event will not be generated. The recommended state for this setting is: 90% or less.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\Eventlog\\Security", 
            "expected_data": "< 91", 
            "exportable": true, 
            "value_name": "WarningLevel", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to 90% or less.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\MSS: (WarningLevel) Percentage threshold for the security event log at which the system will generate a warning\r\n", 
            "active": true
          }
        ], 
        "name": "2.3.10.6 'Percentage threshold for the security event log to generate a warning'"
      }, 
      {
        "comment": "This policy setting determines whether an anonymous user can request security identifier (SID) attributes for another user, or use a SID to obtain its corresponding user name. Disable this policy setting to prevent unauthenticated users from obtaining user names that are associated with their respective SIDs. The recommended state for this setting is: Disabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "0", 
            "object_type": "local_security_policy_settings", 
            "setting": "LSAAnonymousNameLookup", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Allow anonymous SID/Name translation", 
            "active": true
          }
        ], 
        "name": "2.3.11.1 Set 'Network access: Allow anonymous SID/Name translation' to 'Disabled'"
      }, 
      {
        "comment": "This policy setting controls the ability of anonymous users to enumerate the accounts in the Security Accounts Manager (SAM). If you enable this policy setting, users with anonymous connections cannot enumerate domain account user names on the workstations in your environment. This policy setting also allows additional restrictions on anonymous connections. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "RestrictAnonymousSAM", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Do not allow anonymous enumeration of SAM accounts", 
            "active": true
          }
        ], 
        "name": "2.3.11.2 Set 'Network access: Do not allow anonymous enumeration of SAM accounts' to 'Enabled'"
      }, 
      {
        "comment": "This policy setting determines what additional permissions are assigned for anonymous connections to the computer. If you enable this policy setting, anonymous Windows users are allowed to perform certain activities, such as enumerate the names of domain accounts and network shares. An unauthorized user could anonymously list account names and shared resources and use the information to guess passwords or perform social engineering attacks. The recommended state for this setting is: Disabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "EveryoneIncludesAnonymous", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Let Everyone permissions apply to anonymous users", 
            "active": true
          }
        ], 
        "name": "2.3.11.4 Set 'Network access: Let Everyone permissions apply to anonymous users' to 'Disabled'"
      }, 
      {
        "comment": "This policy setting controls the ability of anonymous users to enumerate SAM accounts as well as shares. If you enable this policy setting, anonymous users will not be able to enumerate domain account user names and network share names on the workstations in your environment.\r\nThe Network access: Do not allow anonymous enumeration of SAM accounts and shares setting is configured to Enabled for the two environments that are discussed in this guide. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "RestrictAnonymous", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Do not allow anonymous enumeration of SAM accounts and shares", 
            "active": true
          }
        ], 
        "name": "2.3.11.3 Set 'Network access: Do not allow anonymous enumeration of SAM accounts and shares''"
      }, 
      {
        "comment": "This policy setting determines which communication sessions, or pipes, will have attributes and permissions that allow anonymous access. The recommended state for this setting is:\r\n - Member Servers - None\r\n - Domain Controllers - The following named pipes may be shared   anonymously: LSARPC, NETLOGON, SAMR", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": false, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\LanManServer\\Parameters", 
            "expected_data": "", 
            "exportable": true, 
            "value_name": "NullSessionPipes", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "", 
            "active": true
          }
        ], 
        "name": "2.3.11.5 Configure 'Network Access: Named Pipes that can be accessed anonymously'"
      }, 
      {
        "comment": "This policy setting determines which registry paths will be accessible after referencing the WinReg key to determine access permissions to the paths.\r\nNote: This setting does not exist in Windows XP. There was a setting with that name in Windows XP, but it is called \"Network access: Remotely accessible registry paths and subpaths\" in Windows Server 2003, Windows Vista, and Windows Server 2008.\r\nNote: When you configure this setting you specify a list of one or more objects. The delimiter used when entering the list is a line feed or carriage return, that is, type the first object on the list, press the Enter button, type the next object, press Enter again, etc. The setting value is stored as a comma-delimited list in group policy security templates. It is also rendered as a comma-delimited list in Group Policy Editor's display pane and the Resultant Set of Policy console. It is recorded in the registry as a line-feed delimited list in a REG_MULTI_SZ value. The recommended state for this setting is:\r\nSystem\\CurrentControlSet\\Control\\ProductOptions\r\nSystem\\CurrentControlSet\\Control\\Server Applications\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedExact Paths", 
            "expected_data": "System\\CurrentControlSet\\Control\\ProductOptions", 
            "exportable": true, 
            "value_name": "Machine", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to System\\CurrentControlSet\\Control\\ProductOptions\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Remotely accessible registry paths", 
            "active": true
          }, 
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedExact Paths", 
            "expected_data": "System\\CurrentControlSet\\Control\\Server Applications", 
            "exportable": true, 
            "value_name": "Machine", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to System\\CurrentControlSet\\Control\\Server Applications\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Remotely accessible registry paths", 
            "active": true
          }, 
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedExact Paths", 
            "expected_data": "Software\\Microsoft\\Windows NT\\CurrentVersion", 
            "exportable": true, 
            "value_name": "Machine", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Software\\Microsoft\\Windows NT\\CurrentVersion.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Remotely accessible registry paths", 
            "active": true
          }
        ], 
        "name": "2.3.11.6 Set 'Network access: Remotely accessible registry paths'"
      }, 
      {
        "comment": "This policy setting determines which registry paths and sub-paths will be accessible when an application or process references the WinReg key to determine access permissions.\r\nNote: In Windows XP this setting is called \"Network access: Remotely accessible registry paths,\" the setting with that same name in Windows Vista, Windows Server 2008, and Windows Server 2003 does not exist in Windows XP.\r\nNote: When you configure this setting you specify a list of one or more objects. The delimiter used when entering the list is a line feed or carriage return, that is, type the first object on the list, press the Enter button, type the next object, press Enter again, etc. The setting value is stored as a comma-delimited list in group policy security templates. It is also rendered as a comma-delimited list in Group Policy Editor's display pane and the Resultant Set of Policy console. It is recorded in the registry as a line-feed delimited list in a REG_MULTI_SZ value. The recommended state for this setting is:\r\nSystem\\CurrentControlSet\\Control\\Print\\Printers\r\nSystem\\CurrentControlSet\\Services\\Eventlog\r\nSoftware\\Microsoft\\OLAP Server\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Print\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Windows\r\nSystem\\CurrentControlSet\\Control\\ContentIndex\r\nSystem\\CurrentControlSet\\Control\\Terminal Server\r\nSystem\\CurrentControlSet\\Control\\Terminal Server\\UserConfig\r\nSystem\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Perflib\r\nSystem\\CurrentControlSet\\Services\\SysmonLog", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedPaths", 
            "expected_data": "System\\CurrentControlSet\\Control\\Print\\Printers", 
            "exportable": true, 
            "value_name": "Machine", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to\r\nSystem\\CurrentControlSet\\Control\\Print\\Printers System\\CurrentControlSet\\Services\\Eventlog\r\nSoftware\\Microsoft\\OLAP Server\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Print Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows System\\CurrentControlSet\\Control\\ContentIndex System\\CurrentControlSet\\Control\\Terminal Server System\\CurrentControlSet\\Control\\Terminal Server\\UserConfig System\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration Software\\Microsoft\\Windows NT\\CurrentVersion\\Perflib\r\nSystem\\CurrentControlSet\\Services\\SysmonLog.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Remotely accessible registry paths and sub-paths\r\n", 
            "active": true
          }, 
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedPaths", 
            "expected_data": "System\\CurrentControlSet\\Services\\Eventlog", 
            "exportable": true, 
            "value_name": "Machine", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to\r\nSystem\\CurrentControlSet\\Control\\Print\\Printers System\\CurrentControlSet\\Services\\Eventlog\r\nSoftware\\Microsoft\\OLAP Server\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Print Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows System\\CurrentControlSet\\Control\\ContentIndex System\\CurrentControlSet\\Control\\Terminal Server System\\CurrentControlSet\\Control\\Terminal Server\\UserConfig System\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration Software\\Microsoft\\Windows NT\\CurrentVersion\\Perflib\r\nSystem\\CurrentControlSet\\Services\\SysmonLog.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Remotely accessible registry paths and sub-paths\r\n", 
            "active": true
          }, 
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedPaths", 
            "expected_data": "Software\\Microsoft\\OLAP Server", 
            "exportable": true, 
            "value_name": "Machine", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to\r\nSystem\\CurrentControlSet\\Control\\Print\\Printers System\\CurrentControlSet\\Services\\Eventlog\r\nSoftware\\Microsoft\\OLAP Server\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Print Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows System\\CurrentControlSet\\Control\\ContentIndex System\\CurrentControlSet\\Control\\Terminal Server System\\CurrentControlSet\\Control\\Terminal Server\\UserConfig System\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration Software\\Microsoft\\Windows NT\\CurrentVersion\\Perflib\r\nSystem\\CurrentControlSet\\Services\\SysmonLog.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Remotely accessible registry paths and sub-paths\r\n", 
            "active": true
          }, 
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedPaths", 
            "expected_data": "Software\\Microsoft\\Windows NT\\CurrentVersion\\Print", 
            "exportable": true, 
            "value_name": "Machine", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to\r\nSystem\\CurrentControlSet\\Control\\Print\\Printers System\\CurrentControlSet\\Services\\Eventlog\r\nSoftware\\Microsoft\\OLAP Server\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Print Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows System\\CurrentControlSet\\Control\\ContentIndex System\\CurrentControlSet\\Control\\Terminal Server System\\CurrentControlSet\\Control\\Terminal Server\\UserConfig System\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration Software\\Microsoft\\Windows NT\\CurrentVersion\\Perflib\r\nSystem\\CurrentControlSet\\Services\\SysmonLog.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Remotely accessible registry paths and sub-paths\r\n", 
            "active": true
          }, 
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedPaths", 
            "expected_data": "Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows", 
            "exportable": true, 
            "value_name": "Machine", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to\r\nSystem\\CurrentControlSet\\Control\\Print\\Printers System\\CurrentControlSet\\Services\\Eventlog\r\nSoftware\\Microsoft\\OLAP Server\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Print Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows System\\CurrentControlSet\\Control\\ContentIndex System\\CurrentControlSet\\Control\\Terminal Server System\\CurrentControlSet\\Control\\Terminal Server\\UserConfig System\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration Software\\Microsoft\\Windows NT\\CurrentVersion\\Perflib\r\nSystem\\CurrentControlSet\\Services\\SysmonLog.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Remotely accessible registry paths and sub-paths\r\n", 
            "active": true
          }, 
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedPaths", 
            "expected_data": "System\\CurrentControlSet\\Control\\ContentIndex", 
            "exportable": true, 
            "value_name": "Machine", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to\r\nSystem\\CurrentControlSet\\Control\\Print\\Printers System\\CurrentControlSet\\Services\\Eventlog\r\nSoftware\\Microsoft\\OLAP Server\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Print Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows System\\CurrentControlSet\\Control\\ContentIndex System\\CurrentControlSet\\Control\\Terminal Server System\\CurrentControlSet\\Control\\Terminal Server\\UserConfig System\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration Software\\Microsoft\\Windows NT\\CurrentVersion\\Perflib\r\nSystem\\CurrentControlSet\\Services\\SysmonLog.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Remotely accessible registry paths and sub-paths\r\n", 
            "active": true
          }, 
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedPaths", 
            "expected_data": "System\\CurrentControlSet\\Control\\Terminal Server", 
            "exportable": true, 
            "value_name": "Machine", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to\r\nSystem\\CurrentControlSet\\Control\\Print\\Printers System\\CurrentControlSet\\Services\\Eventlog\r\nSoftware\\Microsoft\\OLAP Server\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Print Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows System\\CurrentControlSet\\Control\\ContentIndex System\\CurrentControlSet\\Control\\Terminal Server System\\CurrentControlSet\\Control\\Terminal Server\\UserConfig System\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration Software\\Microsoft\\Windows NT\\CurrentVersion\\Perflib\r\nSystem\\CurrentControlSet\\Services\\SysmonLog.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Remotely accessible registry paths and sub-paths\r\n", 
            "active": true
          }, 
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedPaths", 
            "expected_data": "System\\CurrentControlSet\\Control\\Terminal Server\\UserConfig", 
            "exportable": true, 
            "value_name": "Machine", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to\r\nSystem\\CurrentControlSet\\Control\\Print\\Printers System\\CurrentControlSet\\Services\\Eventlog\r\nSoftware\\Microsoft\\OLAP Server\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Print Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows System\\CurrentControlSet\\Control\\ContentIndex System\\CurrentControlSet\\Control\\Terminal Server System\\CurrentControlSet\\Control\\Terminal Server\\UserConfig System\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration Software\\Microsoft\\Windows NT\\CurrentVersion\\Perflib\r\nSystem\\CurrentControlSet\\Services\\SysmonLog.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Remotely accessible registry paths and sub-paths\r\n", 
            "active": true
          }, 
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedPaths", 
            "expected_data": "System\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration", 
            "exportable": true, 
            "value_name": "Machine", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to\r\nSystem\\CurrentControlSet\\Control\\Print\\Printers System\\CurrentControlSet\\Services\\Eventlog\r\nSoftware\\Microsoft\\OLAP Server\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Print Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows System\\CurrentControlSet\\Control\\ContentIndex System\\CurrentControlSet\\Control\\Terminal Server System\\CurrentControlSet\\Control\\Terminal Server\\UserConfig System\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration Software\\Microsoft\\Windows NT\\CurrentVersion\\Perflib\r\nSystem\\CurrentControlSet\\Services\\SysmonLog.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Remotely accessible registry paths and sub-paths\r\n", 
            "active": true
          }, 
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedPaths", 
            "expected_data": "Software\\Microsoft\\Windows NT\\CurrentVersion\\Perflib", 
            "exportable": true, 
            "value_name": "Machine", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to\r\nSystem\\CurrentControlSet\\Control\\Print\\Printers System\\CurrentControlSet\\Services\\Eventlog\r\nSoftware\\Microsoft\\OLAP Server\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Print Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows System\\CurrentControlSet\\Control\\ContentIndex System\\CurrentControlSet\\Control\\Terminal Server System\\CurrentControlSet\\Control\\Terminal Server\\UserConfig System\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration Software\\Microsoft\\Windows NT\\CurrentVersion\\Perflib\r\nSystem\\CurrentControlSet\\Services\\SysmonLog.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Remotely accessible registry paths and sub-paths\r\n", 
            "active": true
          }, 
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedPaths", 
            "expected_data": "System\\CurrentControlSet\\Services\\SysmonLog", 
            "exportable": true, 
            "value_name": "Machine", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to\r\nSystem\\CurrentControlSet\\Control\\Print\\Printers System\\CurrentControlSet\\Services\\Eventlog\r\nSoftware\\Microsoft\\OLAP Server\r\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Print Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows System\\CurrentControlSet\\Control\\ContentIndex System\\CurrentControlSet\\Control\\Terminal Server System\\CurrentControlSet\\Control\\Terminal Server\\UserConfig System\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration Software\\Microsoft\\Windows NT\\CurrentVersion\\Perflib\r\nSystem\\CurrentControlSet\\Services\\SysmonLog.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Remotely accessible registry paths and sub-paths\r\n", 
            "active": true
          }
        ], 
        "name": "2.3.11.7 Set 'Network access: Remotely accessible registry paths and sub- paths' "
      }, 
      {
        "comment": "When enabled, this policy setting restricts anonymous access to only those shares and pipes that are named in the Network access: Named pipes that can be accessed anonymously and Network access: Shares that can be accessed anonymously settings. This policy setting controls null session access to shares on your computers by adding RestrictNullSessAccess with the value 1 in the HKLM\\System \\CurrentControlSet\\Services\\LanManServer\\Parameters registry key. This registry value toggles null session shares on or off to control whether the server service restricts unauthenticated clients' access to named resources. Null sessions are a weakness that can be exploited through shares (including the default shares) on computers in your environment. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\LanManServer\\Parameters", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "restrictnullsessaccess", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Restrict anonymous access to Named Pipes and Shares", 
            "active": true
          }
        ], 
        "name": " 2.3.11.8 Set 'Network access: Restrict anonymous access to Named Pipes and Shares' to 'Enabled'"
      }, 
      {
        "comment": "This policy setting determines which network shares can be accessed by anonymous users. The default configuration for this policy setting has little effect because all users have to be authenticated before they can access shared resources on the server. The recommended state for this setting is None", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\LanManServer\\Parameters", 
            "expected_data": "Enabled:None", 
            "exportable": true, 
            "value_name": "NullSessionShares", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Enabled:None.\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Shares that can be accessed anonymously", 
            "active": true
          }
        ], 
        "name": "2.3.11.9 Set 'Network access: Shares that can be accessed anonymously' to 'None'"
      }, 
      {
        "comment": "This policy setting determines how network logons that use local accounts are authenticated. The Classic option allows precise control over access to resources, including the ability to assign different types of access to different users for the same resource. The Guest only option allows you to treat all users equally. In this context, all users authenticate as Guest only to receive the same access level to a given resource. The recommended state for this setting is: Classic - local users authenticate as themselves.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "ForceGuest", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Classic - local users authenticate as themselves.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network access: Sharing and security model for local accounts", 
            "active": true
          }
        ], 
        "name": "2.3.11.10 Set 'Network access: Sharing and security model for local accounts' "
      }, 
      {
        "comment": "\r\nThe policy setting allows programs that run on behalf of a user to impersonate that user (or another specified account) so that they can act on behalf of the user. If this user right is required for this kind of impersonation, an unauthorized user will not be able to convince a client to connectfor example, by remote procedure call (RPC) or named pipesto a service that they have created to impersonate that client, which could elevate the unauthorized user's permissions to administrative or system levels.\r\nServices that are started by the Service Control Manager have the built-in Service group added by default to their access tokens. COM servers that are started by the COM infrastructure and configured to run under a specific account also have the Service group added to their access tokens. As a result, these processes are assigned this user right when they are started.\r\nAlso, a user can impersonate an access token if any of the following conditions exist:\r\n- The access token that is being impersonated is for this user.\r\n- The user, in this logon session, logged on to the network with explicit credentials to create the access token.\r\n- The requested level is less than Impersonate, such as Anonymous or Identify.\r\nAn attacker with the Impersonate a client after authentication user right could create a service, trick a client to make them connect to the service, and then impersonate that client to elevate the attacker's level of access to that of the client.\r\nThe recommended state for this setting is: Administrators, LOCAL SERVICE, NETWORK SERVICE, SERVICE.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators, LOCAL SERVICE, NETWORK SERVICE, SERVICE", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeImpersonatePrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators, LOCAL SERVICE, NETWORK SERVICE, SERVICE.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Impersonate a client after authentication", 
            "active": true
          }
        ], 
        "name": " 2.2.25 Set 'Impersonate a client after authentication' "
      }, 
      {
        "comment": "This policy setting allows users to manage the system's volume or disk configuration, which could allow a usre to delete a volume and cause data loss as well as a denial-of-service condition. \r\nThe recommended state for this setting is: Administrators", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeManageVolumePrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Perform volume maintenance tasks", 
            "active": true
          }
        ], 
        "name": " 2.2.32 Set 'Perform volume maintenance tasks' to 'Administrators' "
      }, 
      {
        "comment": "This policy setting determines which users can bypass file, directory, registry, and other persistent object permissions when restoring backed up files and directories on computers that run Windows Vista in your environment. This user right also determines which users can set valid security principles as object owners; it is similar to the Back up files and directories user right. \r\nThe recommended state for this setting is: Administrators\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeRestorePrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Restore files and directories", 
            "active": true
          }
        ], 
        "name": "2.2.36 Set 'Restore files and directories' to 'Administrators' "
      }, 
      {
        "comment": "This policy setting allows users to dynamically load a new device driver on a system. An attacker could potentially use this capability to install malicious code that appears to be a device driver. This user right is required for users to add local printers or printer drivers in Windows Vista.\r\nThe recommended state for this setting is: Administrators.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeLoadDriverPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Load and unload device drivers", 
            "active": true
          }
        ], 
        "name": " 2.2.27 Set 'Load and unload device drivers' to 'Administrators' "
      }, 
      {
        "comment": "This policy setting allows a process to keep data in physical memory, which prevents the system from paging the data to virtual memory on disk. If this user right is assigned, significant degradation of system perforamce can occur. The recommended state for this setting is: No One ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeLockMemoryPrivilege", 
            "suggestion": "To implement the reommended configuration state, set the following Group Policy setting to No One. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Lock pages in memory", 
            "active": true
          }
        ], 
        "name": " 2.2.28 Set 'Lock pages in memory' to 'No One'"
      }, 
      {
        "comment": "This policy setting prevents users from adding new Microsoft accounts on this computer.\r\nIf you select the \"Users can't add Microsoft accounts\" option, users will not be able to create new Microsoft accounts on this computer, switch a local account to a Microsoft account, or connect a domain account to a Microsoft account. This is the preferred option if you need to limit the use of Microsoft accounts in your enterprise.\r\nIf you select the \"Users can't add or log on with Microsoft accounts\" option, existing Microsoft account users will not be able to log on to Windows. Selecting this option might make it impossible for an existing administrator on this computer to log on and manage the system. If you disable or do not configure this policy (recommended), users will be able to use Microsoft accounts with Windows. The recommended state for this setting is: Users can't add or log on with Microsoft accounts.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "3", 
            "exportable": true, 
            "value_name": "NoConnectedUser", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "", 
            "active": true
          }
        ], 
        "name": "2.3.1.1 Set 'Accounts: Block Microsoft accounts' "
      }, 
      {
        "comment": "This policy setting determines which users can change the auditing options for files and directions and clear the Security log.\r\nThe recommended state for this setting is: Administrators. ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeSecurityPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Manage auditing and security log", 
            "active": true
          }
        ], 
        "name": "2.2.29 Set 'Manage auditing and security log' to 'Administrators'"
      }, 
      {
        "comment": "This privilege determines which users accounts can modify the integrity label of objects, such as files, registry keys, or processes owned by other users. Proccess running under a user account can modify the label of an object owned by that user to lower level without this privilege. \r\nThe recommended state for this setting is: No One", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeRelabelPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to No One. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Modify an object label", 
            "active": true
          }
        ], 
        "name": "2.2.30 Set 'Modify an object label' to 'No One' "
      }, 
      {
        "comment": "This policy setting allows users to configure the system-wide environment variables that affect hardware configuration. This information is typically stored in the Last Known Good Configuration. Modification of these values and could lead to a hardware failure that would result in a denial of service condition. \r\nThe recommended state for this setting is: Administrators ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeSystemEnvironmentPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Modify firmware environment values", 
            "active": true
          }
        ], 
        "name": "2.2.31 Set 'Modify firmware environment values' to 'Administrators'"
      }, 
      {
        "comment": "This policy setting determines which users can use tools to monitor the performance of non- system processes. Typically, you do not need to configure this user right to use the Microsoft Management Console (MMC) Performance snap-in. However, you do need this user right if System Monitor is configured to collect data using Windows Management Instrumentation (WMI). Restricting the Profile single process user right prevents intruders from gaining additional information that could be used to mount an attack on the system.\r\nThe recommended state for this setting is: Administrators.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeProfileSingleProcessPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Profile single process", 
            "active": true
          }
        ], 
        "name": "2.2.33 Set 'Profile single process' to 'Administrators'"
      }, 
      {
        "comment": "This policy setting allows users to use tools to view the performance of different system processes, which could be abused to allow attackers to determine a system's active processes and provide insight into the potential attack surface of the computer.\r\nThe recommended state for this setting is: Administrators, NT SERVICE\\WdiServiceHost.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators, NT SERVICE\\WdiServiceHost", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeSystemProfilePrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators, NT SERVICE\\WdiServiceHost\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Profile system performance", 
            "active": true
          }
        ], 
        "name": "2.2.34 Set 'Profile system performance' to 'Administrators, NT SERVICE\\WdiServiceHost' "
      }, 
      {
        "comment": "This policy setting allows one process or service to start another service or process with a different security access token, which can be used to modify the security access token of that sub-process and result in the escalation of privileges. \r\nThe recommended state for this setting is: LOCAL SERVICE, NETWORK SERVICE", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "LOCAL SERVICE, NETWORK SERVICE", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeAssignPrimaryTokenPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to LOCAL SERVICE, NETWORK SERVICE\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Replace a process level token", 
            "active": true
          }
        ], 
        "name": "2.2.35 Set 'Replace a process level token' to 'LOCAL SERVICE, NETWORK SERVICE'"
      }, 
      {
        "comment": "The policy setting determines which users who are logged on locally to the computers in your environment can shut down the operating system with the Shut Down command. Misuse of this user right can result in a denial of service condition. \r\nThe recommended state for this setting is: Administrators", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators ", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeShutdownPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators ", 
            "active": true
          }
        ], 
        "name": "2.2.37 Set 'Shut down the system' to 'Administrators'"
      }, 
      {
        "comment": "This security setting determines which users and groups have the authority to synchronize all directory service data. The recommended state for this setting is: No One ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeSyncAgentPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to No One. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Synchronize directory service data", 
            "active": true
          }
        ], 
        "name": "2.2.38 Set 'Synchronize directory service data' to 'No One' "
      }, 
      {
        "comment": "This policy setting allows users to take ownership of files, folders, registry keys, processes, or threads. This user right bypasses any permissions that are in place to protect objects to give ownership to the specified user. \r\nThe recommended state for this setting is: Administrators.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeTakeOwnershipPrivilege", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Administrators \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Take ownership of files or other objects", 
            "active": true
          }
        ], 
        "name": "2.2.39 Set 'Take ownership of files or other objects' to 'Administrators' "
      }, 
      {
        "comment": "This policy setting determines whether the Guest account is enabled or disabled. The Guest account allows unauthenticated network users to gain access to the system. Note that this setting will have no impact when applied to the domain controller organizational unit via group policy because domain controllers have no local account database. It can be configured at the domain level via group policy, similar to account lockout and password policy settings. The recommended state for this setting is: Disabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "0", 
            "object_type": "local_security_policy_settings", 
            "setting": "EnableGuestAccount", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Accounts: Guest account status", 
            "active": true
          }
        ], 
        "name": "2.3.1.2 Set 'Accounts: Guest account status' to 'Disabled' "
      }, 
      {
        "comment": "This policy setting determines whether local accounts that are not password protected can be used to log on from locations other than the physical computer console. If you enable this policy setting, local accounts that have blank passwords will not be able to log on to the network from remote client computers. Such accounts will only be able to log on at the keyboard of the computer. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "Administrators", 
            "object_type": "local_user_rights_assignment", 
            "setting": "SeTrustedCredManAccessPrivilege", 
            "suggestion": "", 
            "active": false
          }
        ], 
        "name": "2.3.1.3 Set 'Accounts: Limit local account use of blank passwords to console logon only' "
      }, 
      {
        "comment": "When enabled, this policy setting causes Local System services that use Negotiate to use the computer identity when NTLM authentication is selected by the negotiation. The recommended state for this setting is: Enabled", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "UseMachineId", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network security: Allow Local System to use computer identity for NTLM", 
            "active": true
          }
        ], 
        "name": "2.3.12.1 Set 'Network security: Allow local System to user computer identity for NTLM' to 'Enabled'"
      }, 
      {
        "comment": "Allow NTLM to fall back to NULL session when used with LocalSystem.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa\\MSV1_0", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "allownullsessionfallback", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network security: Allow LocalSystem NULL session fallback", 
            "active": true
          }
        ], 
        "name": "2.3.12.2 Set 'Network security: Allow LocalSystem NULL session fallback' to 'Disabled' "
      }, 
      {
        "comment": "This policy setting allows you to set the encryption types that Kerberos is allowed to use. This policy is supported on at least Windows 7 or Windows Server 2008 R2. The recommended state for this setting is: RC4\\AES128\\AES256\\Future types.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\Kerberos\\Parameters", 
            "expected_data": "28", 
            "exportable": true, 
            "value_name": "SupportedEncryptionTypes", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to RC4\\AES128\\AES256\\Future types.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network Security: Configure encryption types allowed for Kerberos", 
            "active": true
          }
        ], 
        "name": "2.3.12.4 Set 'Network Security: Configure encryption types allowed for Kerberos'"
      }, 
      {
        "comment": "This policy setting determines whether the LAN Manager (LM) hash value for the new password is stored when the password is changed. The LM hash is relatively weak and prone to attack compared to the cryptographically stronger Microsoft Windows NT' hash.\r\nNote Older operating systems and some third-party applications may fail when this policy setting is enabled. Also you will need to change the password on all accounts after you enable this setting. The recommended state for this setting is: Enabled", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "NoLMHash", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network security: Do not store LAN Manager hash value on next password change", 
            "active": true
          }
        ], 
        "name": "2.3.12.5 Set 'Network security: Do not store LAN Manager hash value on next password change'"
      }, 
      {
        "comment": "\r\nThis policy setting, which determines whether to disconnect users who are connected to the local computer outside their user account's valid logon hours, affects the SMB component. If you enable this policy setting, client sessions with the SMB server will be disconnected when the client's logon hours expire. If you disable this policy setting, established client sessions will be maintained after the client's logon hours expire.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "exportable": true, 
            "desired_value": "1", 
            "object_type": "local_security_policy_settings", 
            "setting": "ForceLogoffWhenHourExpire", 
            "suggestion": "To establish the recommended configuration via GP, set the following UI path to Enabled.\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network security: Force logoff when logon hours expire", 
            "active": true
          }
        ], 
        "name": "2.3.12.6 Set 'Network security: Force logoff when logon hours expire' to 'Enabled' "
      }, 
      {
        "comment": "LAN Manager (LM) is a family of early Microsoft client/server software that allows users to link personal computers together on a single network. Network capabilities include transparent file and print sharing, user security features, and network administration tools. In Active Directory domains, the Kerberos protocol is the default authentication protocol. However, if the Kerberos protocol is not negotiated for some reason, Active Directory will use LM, NTLM, or NTLMv2.\r\nLAN Manager authentication includes the LM, NTLM, and NTLM version 2 (NTLMv2) variants, and is the protocol that is used to authenticate all Windows clients when they perform the following operations:\r\n  Join a domain\r\n  Authenticate between Active Directory forests\r\n  Authenticate to down-level domains\r\n  Authenticate to computers that do not run Windows 2000, Windows Server 2003, or Windows XP)\r\n Authenticate to computers that are not in the domain\r\n\r\nThe possible values for the Network security: LAN Manager authentication level setting are:\r\n Send LM & NTLM responses\r\n Send LM & NTLM  use NTLMv2 session security if negotiated\r\n Send NTLM responses only\r\n Send NTLMv2 responses only\r\n Send NTLMv2 responses only\\refuse LM\r\n Send NTLMv2 responses only\\refuse LM & NTLM\r\n\r\nNot Defined - The Network security: LAN Manager authentication level setting determines which challenge/response authentication protocol is used for network logons. This choice affects the authentication protocol level that clients use, the session security level that the computers negotiate, and the authentication level that servers accept as follows:\r\nSend LM & NTLM responses - Clients use LM and NTLM authentication and never use NTLMv2 session security. Domain controllers accept LM, NTLM, and NTLMv2 authentication.\r\nSend LM & NTLM use NTLMv2 session security if negotiated - Clients use LM and NTLM authentication and use NTLMv2 session security if the server supports it. Domain controllers accept LM, NTLM, and NTLMv2 authentication.\r\nSend NTLM response only - Clients use NTLM authentication only and use NTLMv2 session security if the server supports it. Domain controllers accept LM, NTLM, and NTLMv2 authentication.\r\nSend NTLMv2 response only - Clients use NTLMv2 authentication only and use NTLMv2 session security if the server supports it. Domain controllers accept LM, NTLM, and NTLMv2 authentication.\r\nSend NTLMv2 response only\\refuse LM - Clients use NTLMv2 authentication only and use NTLMv2 session security if the server supports it. Domain controllers refuse LM (accept only NTLM and NTLMv2 authentication).\r\nSend NTLMv2 response only\\refuse LM & NTLM - Clients use NTLMv2 authentication only and use NTLMv2 session security if the server supports it. Domain controllers refuse LM and NTLM (accept only NTLMv2 authentication).\r\n\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa", 
            "expected_data": "5", 
            "exportable": true, 
            "value_name": "LmCompatibilityLevel", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Send NTLMv2 response only, Refuse LM &NTLM\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network security: LAN Manager authentication level", 
            "active": true
          }
        ], 
        "name": "2.3.12.7 Set 'Network security: LAN Manager authentication level' "
      }, 
      {
        "comment": "This policy setting determines the level of data signing that is requested on behalf of clients that issue LDAP BIND requests, as follows:\r\n- None. The LDAP BIND request is issued with the caller-specified options.\r\n- Negotiate signing. If Transport Layer Security/Secure Sockets Layer (TLS/SSL) has not been started, the LDAP BIND request is initiated with the LDAP data signing option set in addition to the caller-specified options. If TLS/SSL has been started, the LDAP BIND request is initiated with the caller-specified options.\r\n- Require signature. This level is the same as Negotiate signing. However, if the LDAP server's intermediate saslBindInProgress response does not indicate that LDAP traffic signing is required, the caller is told that the LDAP BIND command request failed.\r\nNote: This policy setting does not have any impact on ldap_simple_bind or ldap_simple_bind_s. No Microsoft LDAP clients that are included with Windows XP Professional use ldap_simple_bind or ldap_simple_bind_s to communicate with a domain controller.\r\nThe possible values for the Network security: LDAP client signing requirements setting are: - None\r\n- Negotiate signing\r\n- Require signature\r\n- Not Defined The recommended state for this setting is: Negotiate signing.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\LDAP", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "LDAPClientIntegrity", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Negotiate signing.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network security: LDAP client signing requirements", 
            "active": true
          }
        ], 
        "name": " 2.3.12.8 Set 'Network security: LDAP client signing requirements' to 'Negotiate signing' or higher "
      }, 
      {
        "comment": "This polict setting determines which behaviors are allowed for applications using the NTLM Security Support Provider (SSP). The SSP Interface (SSPI) is used to by applications that need authentication services. The setting does not modify how the authentication sequence works but instead require certain behaviors in applications that use the SSPI. \r\nThe possible values for the Network security: Minimum session security for NTLM SSP based (including secure RPC) clients setting are:\r\n- Require message confidentiality. This option is only available in Windows XP and Windows Server 2003, the connection will fail if encryption is not negotiated. Encryption converts data into a form that is not readable until decrypted.\r\n- Require message integrity. This option is only available in Windows XP and Windows Server 2003, the connection will fail if message integrity is not negotiated. The integrity of a message can be assessed through message signing. Message signing proves that the message has not been tampered with; it attaches a cryptographic signature that identifies the sender and is a numeric representation of the contents of the message.\r\n- Require 128-bit encryption. The connection will fail if strong encryption (128-bit) is not negotiated.\r\n- Require NTLMv2 session security. The connection will fail if the NTLMv2 protocol is not negotiated.\r\n- Not Defined. The recommended state for this setting is: Require NTLMv2 session security,Require 128-bit encryption.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa\\MSV1_0", 
            "expected_data": "537395200", 
            "exportable": true, 
            "value_name": "NTLMMinClientSec", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Require NTLMv2 session security,Require 128-bit encryption.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network security: Minimum session security for NTLM SSP based (including secure\r\nRPC) clients", 
            "active": true
          }
        ], 
        "name": "2.3.12.9 Set 'Network security: Minimum session security for NTLM SSP based clients'"
      }, 
      {
        "comment": "This policy setting makes the Recovery Console SET command available, which allows you to set the following recovery console environment variables:\r\n- AllowWildCards. Enables wildcard support for some commands (such as the DEL command). - AllowAllPaths. Allows access to all files and folders on the computer.\r\n- AllowRemovableMedia. Allows files to be copied to removable media, such as a floppy disk.\r\n- NoCopyPrompt. Does not prompt when overwriting an existing file. The recommended state for this setting is: Disabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Setup\\RecoveryConsole", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "setcommand", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Recovery console: Allow floppy copy and access to all drives and all folders", 
            "active": true
          }
        ], 
        "name": "2.3.13.2 Set 'Recovery console: Allow floppy copy and access to all drives and all folders' "
      }, 
      {
        "comment": "This policy setting determines which behaviors are allowed for applications using the NTLM Security Support Provider (SSP). The SSP Interface (SSPI) is used by applications that need authentication services. The setting does not modify how the authentication sequence works but instead require certain behaviors in applications that use the SSPI.\r\nThe possible values for the Network security: Minimum session security for NTLM SSP based (including secure RPC) servers setting are:\r\n- Require message confidentiality. This option is only available in Windows XP and Windows Server 2003, the connection will fail if encryption is not negotiated. Encryption converts data into a form that is not readable until decrypted.\r\n- Require message integrity. This option is only available in Windows XP and Windows Server 2003, the connection will fail if message integrity is not negotiated. The integrity of a message can be assessed through message signing. Message signing proves that the message has not been tampered with; it attaches a cryptographic signature that identifies the sender and is a numeric representation of the contents of the message.\r\n- Require 128-bit encryption. The connection will fail if strong encryption (128-bit) is not negotiated.\r\n- Require NTLMv2 session security. The connection will fail if the NTLMv2 protocol is not negotiated.\r\n- Not Defined. The recommended state for this setting is: Require NTLMv2 session security,Require 128-bit encryption.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa\\MSV1_0", 
            "expected_data": "537395200", 
            "exportable": true, 
            "value_name": "NTLMMinServerSec", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Require NTLMv2 session security,Require 128-bit encryption.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Network security: Minimum session security for NTLM SSP based (including secure RPC) servers", 
            "active": true
          }
        ], 
        "name": "2.3.12.10 Set 'Network security: Minimum session security for NTLM SSP based servers' "
      }, 
      {
        "comment": "The recovery console is a command-line environment that is used to recover from system problems. If you enable this policy setting, the administrator account is automatically logged on to the recovery console when it is invoked during startup. The recommended state for this setting is: Disabled.\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Setup\\RecoveryConsole", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "securitylevel", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Recovery console: Allow automatic administrative logon", 
            "active": true
          }
        ], 
        "name": "2.3.13.1 Set 'Recovery console: Allow automatic administrative logon' to 'Disabled'"
      }, 
      {
        "comment": "This policy setting controls the behavior of application installation detection for the computer. The options are:\r\n- Enabled: (Default for home) When an application installation package is detected that requires elevation of privilege, the user is prompted to enter an administrative user name and password. If the user enters valid credentials, the operation continues with the applicable privilege.\r\n- Disabled: (Default for enterprise) Application installation packages are not detected and prompted for elevation. Enterprises that are running standard user desktops and use delegated installation technologies such as Group Policy Software Installation or Systems Management Server (SMS) should disable this policy setting. In this case, installer detection is unnecessary. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "EnableInstallerDetection", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\User Account Control: Detect application installations and prompt for elevation", 
            "active": true
          }
        ], 
        "name": "2.3.18.5 Set 'User Account Control: Detect application installations and prompt for elevation' "
      }, 
      {
        "comment": "This policy setting determines whether a computer can be shut down when a user is not logged on. If this policy setting is enabled, the shutdown command is available on the Windows logon screen. It is recommended to disable this policy setting to restrict the ability to shut down the computer to users with credentials on the system. The recommended state for this setting is: Disabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "ShutdownWith outLogon", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Shutdown: Allow system to be shut down without having to log on", 
            "active": true
          }
        ], 
        "name": "2.3.14.1 Set 'Shutdown: Allow system to be shut down without having to log on'"
      }, 
      {
        "comment": "This policy setting determines whether case insensitivity is enforced for all subsystems. The Microsoft Win32' subsystem is case insensitive. However, the kernel supports case sensitivity for other subsystems, such as the Portable Operating System Interface for UNIX (POSIX). Because Windows is case insensitive (but the POSIX subsystem will support case sensitivity), failure to enforce this policy setting makes it possible for a user of the POSIX subsystem to create a file with the same name as another file by using mixed case to label it. Such a situation can block access to these files by another user who uses typical Win32 tools, because only one of the files will be available. The recommended state for this setting is: Enabled. ", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session\r\nManager\\Kernel", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "ObCaseInsensitive", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\System objects: Require case insensitivity for non-Windows subsystems", 
            "active": true
          }
        ], 
        "name": "2.3.16.1 Set 'System objects: Require case insensitivity for non-Windows subsystems'"
      }, 
      {
        "comment": "This policy setting controls the behavior of the elevation prompt for standard users. The options are: \r\n- Prompt for credentials: When an operation requires elevation of privilege, the user is prompted to enter an administrative user name and password. If the user enters valid credentials, the operation continues with the applicable privilege.\r\n- Automatically deny elevation requests: When an operation requires elevation of privilege, a configurable access denied error message is displayed. An enterprise that is running desktops as standard user may choose this setting to reduce help desk calls.\r\n- Prompt for credentials on the secure desktop: (Default) When an operation requires elevation of privilege, the user is prompted on the secure desktop to enter a different user name and password. If the user enters valid credentials, the operation continues with the applicable privilege. Note that this option was introduced in Windows 7 and it is not applicable to computers running Windows Vista or Windows Server 2008.\r\n\r\nThe recommended state for this setting is: Automatically deny elevation requests.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "3 ", 
            "exportable": true, 
            "value_name": "ConsentPromptBehaviorUser", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Automatically deny elevation requests: \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\User Account Control: Behavior of the elevation prompt for standard users", 
            "active": true
          }
        ], 
        "name": "2.3.18.4 Set 'User Account Control: Behavior of the elevation prompt for standard users' "
      }, 
      {
        "comment": "This policy setting determines the strength of the default discretionary access control list (DACL) for objects. The setting helps secure objects that can be located and shared among processes and its default configuration strengthens the DACL, because it allows users who are not administrators to read shared objects but does not allow them to modify any that they did not create. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "ProtectionMode", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\System objects: Strengthen default permissions of internal system objects (e.g. Symbolic Links)", 
            "active": true
          }
        ], 
        "name": "2.3.16.2 Set 'System objects: Strengthen default permissions of internal system objects '"
      }, 
      {
        "comment": "This policy setting controls the behavior of Admin Approval Mode for the built-in Administrator account.\r\nThe options are:\r\n- Enabled: The built-in Administrator account uses Admin Approval Mode. By default, any operation that requires elevation of privilege will prompt the user to approve the operation. - Disabled: (Default) The built-in Administrator account runs all applications with full administrative privilege. The recommended state for this setting is: Enabled.\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "FilterAdministratorToken", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\User Account Control: Admin Approval Mode for the Built-in Administrator account", 
            "active": true
          }
        ], 
        "name": " 2.3.18.1 Set 'User Account Control: Admin Approval Mode for the Built-in Administrator account'"
      }, 
      {
        "comment": "This policy setting controls whether User Interface Accessibility (UIAccess or UIA) programs can automatically disable the secure desktop for elevation prompts used by a standard user.\r\n- Enabled: UIA programs, including Windows Remote Assistance, automatically disable the secure desktop for elevation prompts. If you do not disable the \"User Account Control: Switch to the secure desktop when prompting for elevation\" policy setting, the prompts appear on the interactive user's desktop instead of the secure desktop.\r\n- Disabled: (Default) The secure desktop can be disabled only by the user of the interactive desktop or by disabling the \"User Account Control: Switch to the secure desktop when prmpting for evelation\" policy setting. The recommended state for this setting is: Disabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "0", 
            "exportable": true, 
            "value_name": "EnableUIADesktopToggle", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Disabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\User Account Control: Allow UIAccess applications to prompt for elevation without using the secure desktop", 
            "active": true
          }
        ], 
        "name": "2.3.18.2 'Allow UIAccess applications to prompt for elevation without using the secure desktop'"
      }, 
      {
        "comment": "This policy setting controls the behavior of the elevation prompt for administrators.\r\nThe options are:\r\n- Elevate without prompting: Allows privileged accounts to perform an operation that requires elevation without requiring consent or credentials. Note: Use this option only in the most constrained environments.\r\n- Prompt for credentials on the secure desktop: When an operation requires elevation of privilege, the user is prompted on the secure desktop to enter a privileged user name and password. If the user enters valid credentials, the operation continues with the user's highest available privilege.\r\n- Prompt for consent on the secure desktop: When an operation requires elevation of privilege, the user is prompted on the secure desktop to select either Permit or Deny. If the user selects Permit, the operation continues with the user's highest available privilege.\r\n- Prompt for credentials: When an operation requires elevation of privilege, the user is prompted to enter an administrative user name and password. If the user enters valid credentials, the operation continues with the applicable privilege.\r\n- Prompt for consent: When an operation requires elevation of privilege, the user is prompted to select either Permit or Deny. If the user selects Permit, the operation continues with the user's highest available privilege.\r\n- Prompt for consent for non-Windows binaries: (Default) When an operation for a non- Microsoft application requires elevation of privilege, the user is prompted on the secure desktop to select either Permit or Deny. If the user selects Permit, the operation continues with the user's highest available privilege. The recommended state for this setting is: Prompt for consent on the secure desktop.\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "2", 
            "exportable": true, 
            "value_name": "ConsentPromptBehaviorAdmin ", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Prompt for consent on the secure desktop\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\User Account Control: Behavior of the elevation prompt for administrators in Admin Approval Mode", 
            "active": true
          }
        ], 
        "name": "2.3.18.3 'Behavior of the elevation prompt for administrators in Admin Approval Mode' "
      }, 
      {
        "comment": "This policy setting controls whether applications that request to run with a User Interface Accessibility (UIAccess) integrity level must reside in a secure location in the file system. Secure locations are limited to the following:\r\n- ...\\Program Files\\, including subfolders\r\n- ...\\Windows\\system32\\\r\n- ...\\Program Files (x86)\\, including subfolders for 64-bit versions of Windows\r\nNote: Windows enforces a public key infrastructure (PKI) signature check on any interactive application that requests to run with a UIAccess integrity level regardless of the state of this security setting.\r\nThe options are:\r\n- Enabled: (Default) If an application resides in a secure location in the file system, it runs only with UIAccess integrity.\r\n- Disabled: An application runs with UIAccess integrity even if it does not reside in a secure location in the file system. The recommended state for this setting is: Enabled.", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "EnableSecureUIAPaths", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled.\r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\User Account Control: Only elevate UIAccess applications that are installed in secure locations", 
            "active": true
          }
        ], 
        "name": " 2.3.18.6 Set 'Only elevate UIAccess applications that are installed in secure locations'"
      }, 
      {
        "comment": "This policy setting controls the behavior of all User Account Control (UAC) policy settings for the computer. If you change the policy setting, you must restart your computer. \r\nThe options are:\r\n- Enabled: (Default) Admin Approval Mode is enabled. This policy must be enabled and related UAC policy settings must also be set appropriately to allow the built-in Administrator account and all other users who are members of the Administrators group to run in Admin Approval Mode.\r\n- Disabled: Admin Approval Mode and all related UAC policy settings are disabled. Note: If this policy setting is disabled, the Security Center notifies you that the overall security of the operating system has been reduced. The recommended state for this setting is: Enabled.\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "EnableLUA", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\User Account Control: Run all administrators in Admin Approval Mode", 
            "active": true
          }
        ], 
        "name": "2.3.18.7 Set 'User Account Control: Run all administrators in Admin Approval Mode' to 'Enabled'"
      }, 
      {
        "comment": "This policy setting controls whether the elevation request prompt is displayed on the interactive user's desktop or the secure desktop.\r\nThe options are:\r\n- Enabled: (Default) All elevation requests go to the secure desktop regardless of prompt behavior policy settings for administrators and standard users.\r\n- Disabled: All elevation requests go to the interactive user's desktop. Prompt behavior policy settings for administrators and standard users are used. The recommended state for this setting is: Enabled.\r\n", 
        "reference_identifiers": [], 
        "log": false, 
        "taxonomy": "system_configuration", 
        "rule_operator": "AND", 
        "alert": false, 
        "critical": false, 
        "active": true, 
        "checks": [
          {
            "registry_key": "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System", 
            "expected_data": "1", 
            "exportable": true, 
            "value_name": "PromptOnSecureDesktop", 
            "object_type": "registry_key_value_setting", 
            "suggestion": "To implement the recommended configuration state, set the following Group Policy setting to Enabled. \r\n\r\nComputer Configuration\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\User Account Control: Switch to the secure desktop when prompting for elevation", 
            "active": true
          }
        ], 
        "name": " 2.3.18.8 Set 'User Account Control: Switch to the secure desktop when prompting for elevation' "
      }
    ], 
    "id": "4ac311c6058311e5971505fdb7cd3af1", 
    "description": "testing for baseline "
  }
}